/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]

pub const _BITS_UINTN_IDENTITY_H: u32 = 1;
pub const _SYS_SELECT_H: u32 = 1;
pub const __sigset_t_defined: u32 = 1;
pub const __timeval_defined: u32 = 1;
pub const FD_SETSIZE: u32 = 1024;
pub const IB_USER_VERBS_ABI_VERSION: u32 = 6;
pub const IB_USER_VERBS_CMD_THRESHOLD: u32 = 50;
pub const IB_USER_VERBS_CMD_COMMAND_MASK: u32 = 255;
pub const IB_USER_VERBS_CMD_FLAG_EXTENDED: u32 = 2147483648;
pub const IB_USER_VERBS_MAX_LOG_IND_TBL_SIZE: u32 = 13;
pub const IB_DEVICE_NAME_MAX: u32 = 64;
pub const IB_UVERBS_ACCESS_OPTIONAL_FIRST: u32 = 1048576;
pub const IB_UVERBS_ACCESS_OPTIONAL_LAST: u32 = 536870912;
pub const IBV_ACCESS_OPTIONAL_FIRST: u32 = 1048576;
pub const IBV_DEVICE_RAW_SCATTER_FCS: u64 = 17179869184;
pub const IBV_DEVICE_PCI_WRITE_END_PADDING: u64 = 68719476736;
pub const ETHERNET_LL_SIZE: u32 = 6;
pub const IB_ROCE_UDP_ENCAP_VALID_PORT_MIN: u32 = 49152;
pub const IB_ROCE_UDP_ENCAP_VALID_PORT_MAX: u32 = 65535;
pub const IB_GRH_FLOWLABEL_MASK: u32 = 1048575;
pub const IBV_PATH_RECORD_REVERSIBLE: u32 = 128;
pub const IBV_PATH_FLAG_GMP: u32 = 1;
pub const IBV_PATH_FLAG_PRIMARY: u32 = 2;
pub const IBV_PATH_FLAG_ALTERNATE: u32 = 4;
pub const IBV_PATH_FLAG_OUTBOUND: u32 = 8;
pub const IBV_PATH_FLAG_INBOUND: u32 = 16;
pub const IBV_PATH_FLAG_INBOUND_REVERSE: u32 = 32;
pub const IBV_PATH_FLAG_BIDIRECTIONAL: u32 = 40;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_int;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct sched_param {
    pub sched_priority: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sched_param"][::std::mem::size_of::<sched_param>() - 4usize];
    ["Alignment of sched_param"][::std::mem::align_of::<sched_param>() - 4usize];
    ["Offset of field: sched_param::sched_priority"]
        [::std::mem::offset_of!(sched_param, sched_priority) - 0usize];
};
pub type __cpu_mask = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct cpu_set_t {
    pub __bits: [__cpu_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of cpu_set_t"][::std::mem::size_of::<cpu_set_t>() - 128usize];
    ["Alignment of cpu_set_t"][::std::mem::align_of::<cpu_set_t>() - 8usize];
    ["Offset of field: cpu_set_t::__bits"][::std::mem::offset_of!(cpu_set_t, __bits) - 0usize];
};
unsafe extern "C" {
    pub fn __sched_cpucount(__setsize: usize, __setp: *const cpu_set_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __sched_cpualloc(__count: usize) -> *mut cpu_set_t;
}
unsafe extern "C" {
    pub fn __sched_cpufree(__set: *mut cpu_set_t);
}
unsafe extern "C" {
    pub fn sched_setparam(__pid: __pid_t, __param: *const sched_param) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_getparam(__pid: __pid_t, __param: *mut sched_param) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_setscheduler(
        __pid: __pid_t,
        __policy: ::std::os::raw::c_int,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_getscheduler(__pid: __pid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_yield() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_max(__algorithm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_get_priority_min(__algorithm: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn sched_rr_get_interval(__pid: __pid_t, __t: *mut timespec) -> ::std::os::raw::c_int;
}
pub type clock_t = __clock_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 56usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 8usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
    ["Offset of field: tm::tm_gmtoff"][::std::mem::offset_of!(tm, tm_gmtoff) - 40usize];
    ["Offset of field: tm::tm_zone"][::std::mem::offset_of!(tm, tm_zone) - 48usize];
};
impl Default for tm {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of itimerspec"][::std::mem::size_of::<itimerspec>() - 32usize];
    ["Alignment of itimerspec"][::std::mem::align_of::<itimerspec>() - 8usize];
    ["Offset of field: itimerspec::it_interval"]
        [::std::mem::offset_of!(itimerspec, it_interval) - 0usize];
    ["Offset of field: itimerspec::it_value"]
        [::std::mem::offset_of!(itimerspec, it_value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
impl Default for __locale_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
unsafe extern "C" {
    pub fn clock() -> clock_t;
}
unsafe extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
unsafe extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
unsafe extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
unsafe extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
unsafe extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
unsafe extern "C" {
    pub fn tzset();
}
unsafe extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
unsafe extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
impl Default for __atomic_wide_counter {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
impl Default for __pthread_internal_list {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
impl Default for __pthread_internal_slist {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_int,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __pad1: ::std::os::raw::c_ulong,
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
impl Default for __pthread_cond_s {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 8usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
impl Default for pthread_mutexattr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 8usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
impl Default for pthread_condattr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 64usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 64usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
impl Default for pthread_attr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 48usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
impl Default for pthread_mutex_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
impl Default for pthread_cond_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
impl Default for pthread_rwlock_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
impl Default for pthread_rwlockattr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
impl Default for pthread_barrier_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 8usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
impl Default for pthread_barrierattr_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type __jmp_buf = [::std::os::raw::c_ulonglong; 22usize];
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __jmp_buf_tag"][::std::mem::size_of::<__jmp_buf_tag>() - 312usize];
    ["Alignment of __jmp_buf_tag"][::std::mem::align_of::<__jmp_buf_tag>() - 8usize];
    ["Offset of field: __jmp_buf_tag::__jmpbuf"]
        [::std::mem::offset_of!(__jmp_buf_tag, __jmpbuf) - 0usize];
    ["Offset of field: __jmp_buf_tag::__mask_was_saved"]
        [::std::mem::offset_of!(__jmp_buf_tag, __mask_was_saved) - 176usize];
    ["Offset of field: __jmp_buf_tag::__saved_mask"]
        [::std::mem::offset_of!(__jmp_buf_tag, __saved_mask) - 184usize];
};
pub const PTHREAD_CREATE_JOINABLE: _bindgen_ty_1 = 0;
pub const PTHREAD_CREATE_DETACHED: _bindgen_ty_1 = 1;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
pub const PTHREAD_MUTEX_TIMED_NP: _bindgen_ty_2 = 0;
pub const PTHREAD_MUTEX_RECURSIVE_NP: _bindgen_ty_2 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK_NP: _bindgen_ty_2 = 2;
pub const PTHREAD_MUTEX_ADAPTIVE_NP: _bindgen_ty_2 = 3;
pub const PTHREAD_MUTEX_NORMAL: _bindgen_ty_2 = 0;
pub const PTHREAD_MUTEX_RECURSIVE: _bindgen_ty_2 = 1;
pub const PTHREAD_MUTEX_ERRORCHECK: _bindgen_ty_2 = 2;
pub const PTHREAD_MUTEX_DEFAULT: _bindgen_ty_2 = 0;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const PTHREAD_MUTEX_STALLED: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_STALLED_NP: _bindgen_ty_3 = 0;
pub const PTHREAD_MUTEX_ROBUST: _bindgen_ty_3 = 1;
pub const PTHREAD_MUTEX_ROBUST_NP: _bindgen_ty_3 = 1;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub const PTHREAD_PRIO_NONE: _bindgen_ty_4 = 0;
pub const PTHREAD_PRIO_INHERIT: _bindgen_ty_4 = 1;
pub const PTHREAD_PRIO_PROTECT: _bindgen_ty_4 = 2;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const PTHREAD_RWLOCK_PREFER_READER_NP: _bindgen_ty_5 = 0;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NP: _bindgen_ty_5 = 1;
pub const PTHREAD_RWLOCK_PREFER_WRITER_NONRECURSIVE_NP: _bindgen_ty_5 = 2;
pub const PTHREAD_RWLOCK_DEFAULT_NP: _bindgen_ty_5 = 0;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub const PTHREAD_INHERIT_SCHED: _bindgen_ty_6 = 0;
pub const PTHREAD_EXPLICIT_SCHED: _bindgen_ty_6 = 1;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
pub const PTHREAD_SCOPE_SYSTEM: _bindgen_ty_7 = 0;
pub const PTHREAD_SCOPE_PROCESS: _bindgen_ty_7 = 1;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
pub const PTHREAD_PROCESS_PRIVATE: _bindgen_ty_8 = 0;
pub const PTHREAD_PROCESS_SHARED: _bindgen_ty_8 = 1;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _pthread_cleanup_buffer {
    pub __routine: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __arg: *mut ::std::os::raw::c_void,
    pub __canceltype: ::std::os::raw::c_int,
    pub __prev: *mut _pthread_cleanup_buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _pthread_cleanup_buffer"][::std::mem::size_of::<_pthread_cleanup_buffer>() - 32usize];
    ["Alignment of _pthread_cleanup_buffer"]
        [::std::mem::align_of::<_pthread_cleanup_buffer>() - 8usize];
    ["Offset of field: _pthread_cleanup_buffer::__routine"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __routine) - 0usize];
    ["Offset of field: _pthread_cleanup_buffer::__arg"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __arg) - 8usize];
    ["Offset of field: _pthread_cleanup_buffer::__canceltype"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __canceltype) - 16usize];
    ["Offset of field: _pthread_cleanup_buffer::__prev"]
        [::std::mem::offset_of!(_pthread_cleanup_buffer, __prev) - 24usize];
};
impl Default for _pthread_cleanup_buffer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const PTHREAD_CANCEL_ENABLE: _bindgen_ty_9 = 0;
pub const PTHREAD_CANCEL_DISABLE: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
pub const PTHREAD_CANCEL_DEFERRED: _bindgen_ty_10 = 0;
pub const PTHREAD_CANCEL_ASYNCHRONOUS: _bindgen_ty_10 = 1;
pub type _bindgen_ty_10 = ::std::os::raw::c_uint;
unsafe extern "C" {
    pub fn pthread_create(
        __newthread: *mut pthread_t,
        __attr: *const pthread_attr_t,
        __start_routine: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void) -> *mut ::std::os::raw::c_void,
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_exit(__retval: *mut ::std::os::raw::c_void) -> !;
}
unsafe extern "C" {
    pub fn pthread_join(
        __th: pthread_t,
        __thread_return: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_detach(__th: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_self() -> pthread_t;
}
unsafe extern "C" {
    pub fn pthread_equal(__thread1: pthread_t, __thread2: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_init(__attr: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_destroy(__attr: *mut pthread_attr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getdetachstate(
        __attr: *const pthread_attr_t,
        __detachstate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setdetachstate(
        __attr: *mut pthread_attr_t,
        __detachstate: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getguardsize(
        __attr: *const pthread_attr_t,
        __guardsize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setguardsize(
        __attr: *mut pthread_attr_t,
        __guardsize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedparam(
        __attr: *const pthread_attr_t,
        __param: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedparam(
        __attr: *mut pthread_attr_t,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getschedpolicy(
        __attr: *const pthread_attr_t,
        __policy: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setschedpolicy(
        __attr: *mut pthread_attr_t,
        __policy: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getinheritsched(
        __attr: *const pthread_attr_t,
        __inherit: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setinheritsched(
        __attr: *mut pthread_attr_t,
        __inherit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getscope(
        __attr: *const pthread_attr_t,
        __scope: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setscope(
        __attr: *mut pthread_attr_t,
        __scope: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstackaddr(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstackaddr(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstacksize(
        __attr: *const pthread_attr_t,
        __stacksize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstacksize(
        __attr: *mut pthread_attr_t,
        __stacksize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_getstack(
        __attr: *const pthread_attr_t,
        __stackaddr: *mut *mut ::std::os::raw::c_void,
        __stacksize: *mut usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_attr_setstack(
        __attr: *mut pthread_attr_t,
        __stackaddr: *mut ::std::os::raw::c_void,
        __stacksize: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedparam(
        __target_thread: pthread_t,
        __policy: ::std::os::raw::c_int,
        __param: *const sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getschedparam(
        __target_thread: pthread_t,
        __policy: *mut ::std::os::raw::c_int,
        __param: *mut sched_param,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setschedprio(
        __target_thread: pthread_t,
        __prio: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_once(
        __once_control: *mut pthread_once_t,
        __init_routine: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcancelstate(
        __state: ::std::os::raw::c_int,
        __oldstate: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_setcanceltype(
        __type: ::std::os::raw::c_int,
        __oldtype: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cancel(__th: pthread_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_testcancel();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __cancel_jmp_buf_tag {
    pub __cancel_jmp_buf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __cancel_jmp_buf_tag"][::std::mem::size_of::<__cancel_jmp_buf_tag>() - 184usize];
    ["Alignment of __cancel_jmp_buf_tag"][::std::mem::align_of::<__cancel_jmp_buf_tag>() - 8usize];
    ["Offset of field: __cancel_jmp_buf_tag::__cancel_jmp_buf"]
        [::std::mem::offset_of!(__cancel_jmp_buf_tag, __cancel_jmp_buf) - 0usize];
    ["Offset of field: __cancel_jmp_buf_tag::__mask_was_saved"]
        [::std::mem::offset_of!(__cancel_jmp_buf_tag, __mask_was_saved) - 176usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_unwind_buf_t {
    pub __cancel_jmp_buf: [__cancel_jmp_buf_tag; 1usize],
    pub __pad: [*mut ::std::os::raw::c_void; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_unwind_buf_t"][::std::mem::size_of::<__pthread_unwind_buf_t>() - 216usize];
    ["Alignment of __pthread_unwind_buf_t"]
        [::std::mem::align_of::<__pthread_unwind_buf_t>() - 8usize];
    ["Offset of field: __pthread_unwind_buf_t::__cancel_jmp_buf"]
        [::std::mem::offset_of!(__pthread_unwind_buf_t, __cancel_jmp_buf) - 0usize];
    ["Offset of field: __pthread_unwind_buf_t::__pad"]
        [::std::mem::offset_of!(__pthread_unwind_buf_t, __pad) - 184usize];
};
impl Default for __pthread_unwind_buf_t {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_cleanup_frame {
    pub __cancel_routine:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    pub __cancel_arg: *mut ::std::os::raw::c_void,
    pub __do_it: ::std::os::raw::c_int,
    pub __cancel_type: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cleanup_frame"][::std::mem::size_of::<__pthread_cleanup_frame>() - 24usize];
    ["Alignment of __pthread_cleanup_frame"]
        [::std::mem::align_of::<__pthread_cleanup_frame>() - 8usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_routine"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_routine) - 0usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_arg"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_arg) - 8usize];
    ["Offset of field: __pthread_cleanup_frame::__do_it"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __do_it) - 16usize];
    ["Offset of field: __pthread_cleanup_frame::__cancel_type"]
        [::std::mem::offset_of!(__pthread_cleanup_frame, __cancel_type) - 20usize];
};
impl Default for __pthread_cleanup_frame {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn __pthread_register_cancel(__buf: *mut __pthread_unwind_buf_t);
}
unsafe extern "C" {
    pub fn __pthread_unregister_cancel(__buf: *mut __pthread_unwind_buf_t);
}
unsafe extern "C" {
    pub fn __pthread_unwind_next(__buf: *mut __pthread_unwind_buf_t) -> !;
}
unsafe extern "C" {
    pub fn __sigsetjmp(
        __env: *mut __jmp_buf_tag,
        __savemask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_init(
        __mutex: *mut pthread_mutex_t,
        __mutexattr: *const pthread_mutexattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_destroy(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_trylock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_lock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_timedlock(
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_unlock(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_getprioceiling(
        __mutex: *const pthread_mutex_t,
        __prioceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_setprioceiling(
        __mutex: *mut pthread_mutex_t,
        __prioceiling: ::std::os::raw::c_int,
        __old_ceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutex_consistent(__mutex: *mut pthread_mutex_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_init(__attr: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_destroy(__attr: *mut pthread_mutexattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getpshared(
        __attr: *const pthread_mutexattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setpshared(
        __attr: *mut pthread_mutexattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_gettype(
        __attr: *const pthread_mutexattr_t,
        __kind: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_settype(
        __attr: *mut pthread_mutexattr_t,
        __kind: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprotocol(
        __attr: *const pthread_mutexattr_t,
        __protocol: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprotocol(
        __attr: *mut pthread_mutexattr_t,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getprioceiling(
        __attr: *const pthread_mutexattr_t,
        __prioceiling: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setprioceiling(
        __attr: *mut pthread_mutexattr_t,
        __prioceiling: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_getrobust(
        __attr: *const pthread_mutexattr_t,
        __robustness: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_mutexattr_setrobust(
        __attr: *mut pthread_mutexattr_t,
        __robustness: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_init(
        __rwlock: *mut pthread_rwlock_t,
        __attr: *const pthread_rwlockattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_destroy(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_rdlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_tryrdlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_timedrdlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_wrlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_trywrlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_timedwrlock(
        __rwlock: *mut pthread_rwlock_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlock_unlock(__rwlock: *mut pthread_rwlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_init(__attr: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_destroy(__attr: *mut pthread_rwlockattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_getpshared(
        __attr: *const pthread_rwlockattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_setpshared(
        __attr: *mut pthread_rwlockattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_getkind_np(
        __attr: *const pthread_rwlockattr_t,
        __pref: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_rwlockattr_setkind_np(
        __attr: *mut pthread_rwlockattr_t,
        __pref: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_init(
        __cond: *mut pthread_cond_t,
        __cond_attr: *const pthread_condattr_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_destroy(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_signal(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_broadcast(__cond: *mut pthread_cond_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_wait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_cond_timedwait(
        __cond: *mut pthread_cond_t,
        __mutex: *mut pthread_mutex_t,
        __abstime: *const timespec,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_init(__attr: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_destroy(__attr: *mut pthread_condattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getpshared(
        __attr: *const pthread_condattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setpshared(
        __attr: *mut pthread_condattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_getclock(
        __attr: *const pthread_condattr_t,
        __clock_id: *mut __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_condattr_setclock(
        __attr: *mut pthread_condattr_t,
        __clock_id: __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_init(
        __lock: *mut pthread_spinlock_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_destroy(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_lock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_trylock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_spin_unlock(__lock: *mut pthread_spinlock_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_init(
        __barrier: *mut pthread_barrier_t,
        __attr: *const pthread_barrierattr_t,
        __count: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_destroy(__barrier: *mut pthread_barrier_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrier_wait(__barrier: *mut pthread_barrier_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_init(__attr: *mut pthread_barrierattr_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_destroy(__attr: *mut pthread_barrierattr_t)
    -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_getpshared(
        __attr: *const pthread_barrierattr_t,
        __pshared: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_barrierattr_setpshared(
        __attr: *mut pthread_barrierattr_t,
        __pshared: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_create(
        __key: *mut pthread_key_t,
        __destr_function: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void),
        >,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_key_delete(__key: pthread_key_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getspecific(__key: pthread_key_t) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn pthread_setspecific(
        __key: pthread_key_t,
        __pointer: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_getcpuclockid(
        __thread_id: pthread_t,
        __clock_id: *mut __clockid_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pthread_atfork(
        __prepare: ::std::option::Option<unsafe extern "C" fn()>,
        __parent: ::std::option::Option<unsafe extern "C" fn()>,
        __child: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Default, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
unsafe extern "C" {
    pub fn __errno_location() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strchrnul(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcasestr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn memmem(
        __haystack: *const ::std::os::raw::c_void,
        __haystacklen: usize,
        __needle: *const ::std::os::raw::c_void,
        __needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
unsafe extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    );
}
unsafe extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
unsafe extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
unsafe extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strlcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strlcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
pub type __s8 = ::std::os::raw::c_schar;
pub type __u8 = ::std::os::raw::c_uchar;
pub type __s16 = ::std::os::raw::c_short;
pub type __u16 = ::std::os::raw::c_ushort;
pub type __s32 = ::std::os::raw::c_int;
pub type __u32 = ::std::os::raw::c_uint;
pub type __s64 = ::std::os::raw::c_longlong;
pub type __u64 = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fd_set {
    pub fds_bits: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fd_set"][::std::mem::size_of::<__kernel_fd_set>() - 128usize];
    ["Alignment of __kernel_fd_set"][::std::mem::align_of::<__kernel_fd_set>() - 8usize];
    ["Offset of field: __kernel_fd_set::fds_bits"]
        [::std::mem::offset_of!(__kernel_fd_set, fds_bits) - 0usize];
};
pub type __kernel_sighandler_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: ::std::os::raw::c_int)>;
pub type __kernel_key_t = ::std::os::raw::c_int;
pub type __kernel_mqd_t = ::std::os::raw::c_int;
pub type __kernel_old_uid_t = ::std::os::raw::c_ushort;
pub type __kernel_old_gid_t = ::std::os::raw::c_ushort;
pub type __kernel_long_t = ::std::os::raw::c_long;
pub type __kernel_ulong_t = ::std::os::raw::c_ulong;
pub type __kernel_ino_t = __kernel_ulong_t;
pub type __kernel_mode_t = ::std::os::raw::c_uint;
pub type __kernel_pid_t = ::std::os::raw::c_int;
pub type __kernel_ipc_pid_t = ::std::os::raw::c_int;
pub type __kernel_uid_t = ::std::os::raw::c_uint;
pub type __kernel_gid_t = ::std::os::raw::c_uint;
pub type __kernel_suseconds_t = __kernel_long_t;
pub type __kernel_daddr_t = ::std::os::raw::c_int;
pub type __kernel_uid32_t = ::std::os::raw::c_uint;
pub type __kernel_gid32_t = ::std::os::raw::c_uint;
pub type __kernel_old_dev_t = ::std::os::raw::c_uint;
pub type __kernel_size_t = __kernel_ulong_t;
pub type __kernel_ssize_t = __kernel_long_t;
pub type __kernel_ptrdiff_t = __kernel_long_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __kernel_fsid_t {
    pub val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_fsid_t"][::std::mem::size_of::<__kernel_fsid_t>() - 8usize];
    ["Alignment of __kernel_fsid_t"][::std::mem::align_of::<__kernel_fsid_t>() - 4usize];
    ["Offset of field: __kernel_fsid_t::val"]
        [::std::mem::offset_of!(__kernel_fsid_t, val) - 0usize];
};
pub type __kernel_off_t = __kernel_long_t;
pub type __kernel_loff_t = ::std::os::raw::c_longlong;
pub type __kernel_old_time_t = __kernel_long_t;
pub type __kernel_time_t = __kernel_long_t;
pub type __kernel_time64_t = ::std::os::raw::c_longlong;
pub type __kernel_clock_t = __kernel_long_t;
pub type __kernel_timer_t = ::std::os::raw::c_int;
pub type __kernel_clockid_t = ::std::os::raw::c_int;
pub type __kernel_caddr_t = *mut ::std::os::raw::c_char;
pub type __kernel_uid16_t = ::std::os::raw::c_ushort;
pub type __kernel_gid16_t = ::std::os::raw::c_ushort;
pub type __s128 = i128;
pub type __u128 = u128;
pub type __le16 = __u16;
pub type __be16 = __u16;
pub type __le32 = __u32;
pub type __be32 = __u32;
pub type __le64 = __u64;
pub type __be64 = __u64;
pub type __sum16 = __u16;
pub type __wsum = __u32;
pub type __poll_t = ::std::os::raw::c_uint;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
unsafe extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub const IB_USER_VERBS_CMD_GET_CONTEXT: ib_uverbs_write_cmds = 0;
pub const IB_USER_VERBS_CMD_QUERY_DEVICE: ib_uverbs_write_cmds = 1;
pub const IB_USER_VERBS_CMD_QUERY_PORT: ib_uverbs_write_cmds = 2;
pub const IB_USER_VERBS_CMD_ALLOC_PD: ib_uverbs_write_cmds = 3;
pub const IB_USER_VERBS_CMD_DEALLOC_PD: ib_uverbs_write_cmds = 4;
pub const IB_USER_VERBS_CMD_CREATE_AH: ib_uverbs_write_cmds = 5;
pub const IB_USER_VERBS_CMD_MODIFY_AH: ib_uverbs_write_cmds = 6;
pub const IB_USER_VERBS_CMD_QUERY_AH: ib_uverbs_write_cmds = 7;
pub const IB_USER_VERBS_CMD_DESTROY_AH: ib_uverbs_write_cmds = 8;
pub const IB_USER_VERBS_CMD_REG_MR: ib_uverbs_write_cmds = 9;
pub const IB_USER_VERBS_CMD_REG_SMR: ib_uverbs_write_cmds = 10;
pub const IB_USER_VERBS_CMD_REREG_MR: ib_uverbs_write_cmds = 11;
pub const IB_USER_VERBS_CMD_QUERY_MR: ib_uverbs_write_cmds = 12;
pub const IB_USER_VERBS_CMD_DEREG_MR: ib_uverbs_write_cmds = 13;
pub const IB_USER_VERBS_CMD_ALLOC_MW: ib_uverbs_write_cmds = 14;
pub const IB_USER_VERBS_CMD_BIND_MW: ib_uverbs_write_cmds = 15;
pub const IB_USER_VERBS_CMD_DEALLOC_MW: ib_uverbs_write_cmds = 16;
pub const IB_USER_VERBS_CMD_CREATE_COMP_CHANNEL: ib_uverbs_write_cmds = 17;
pub const IB_USER_VERBS_CMD_CREATE_CQ: ib_uverbs_write_cmds = 18;
pub const IB_USER_VERBS_CMD_RESIZE_CQ: ib_uverbs_write_cmds = 19;
pub const IB_USER_VERBS_CMD_DESTROY_CQ: ib_uverbs_write_cmds = 20;
pub const IB_USER_VERBS_CMD_POLL_CQ: ib_uverbs_write_cmds = 21;
pub const IB_USER_VERBS_CMD_PEEK_CQ: ib_uverbs_write_cmds = 22;
pub const IB_USER_VERBS_CMD_REQ_NOTIFY_CQ: ib_uverbs_write_cmds = 23;
pub const IB_USER_VERBS_CMD_CREATE_QP: ib_uverbs_write_cmds = 24;
pub const IB_USER_VERBS_CMD_QUERY_QP: ib_uverbs_write_cmds = 25;
pub const IB_USER_VERBS_CMD_MODIFY_QP: ib_uverbs_write_cmds = 26;
pub const IB_USER_VERBS_CMD_DESTROY_QP: ib_uverbs_write_cmds = 27;
pub const IB_USER_VERBS_CMD_POST_SEND: ib_uverbs_write_cmds = 28;
pub const IB_USER_VERBS_CMD_POST_RECV: ib_uverbs_write_cmds = 29;
pub const IB_USER_VERBS_CMD_ATTACH_MCAST: ib_uverbs_write_cmds = 30;
pub const IB_USER_VERBS_CMD_DETACH_MCAST: ib_uverbs_write_cmds = 31;
pub const IB_USER_VERBS_CMD_CREATE_SRQ: ib_uverbs_write_cmds = 32;
pub const IB_USER_VERBS_CMD_MODIFY_SRQ: ib_uverbs_write_cmds = 33;
pub const IB_USER_VERBS_CMD_QUERY_SRQ: ib_uverbs_write_cmds = 34;
pub const IB_USER_VERBS_CMD_DESTROY_SRQ: ib_uverbs_write_cmds = 35;
pub const IB_USER_VERBS_CMD_POST_SRQ_RECV: ib_uverbs_write_cmds = 36;
pub const IB_USER_VERBS_CMD_OPEN_XRCD: ib_uverbs_write_cmds = 37;
pub const IB_USER_VERBS_CMD_CLOSE_XRCD: ib_uverbs_write_cmds = 38;
pub const IB_USER_VERBS_CMD_CREATE_XSRQ: ib_uverbs_write_cmds = 39;
pub const IB_USER_VERBS_CMD_OPEN_QP: ib_uverbs_write_cmds = 40;
pub type ib_uverbs_write_cmds = ::std::os::raw::c_uint;
pub const IB_USER_VERBS_EX_CMD_QUERY_DEVICE: _bindgen_ty_11 = 1;
pub const IB_USER_VERBS_EX_CMD_CREATE_CQ: _bindgen_ty_11 = 18;
pub const IB_USER_VERBS_EX_CMD_CREATE_QP: _bindgen_ty_11 = 24;
pub const IB_USER_VERBS_EX_CMD_MODIFY_QP: _bindgen_ty_11 = 26;
pub const IB_USER_VERBS_EX_CMD_CREATE_FLOW: _bindgen_ty_11 = 50;
pub const IB_USER_VERBS_EX_CMD_DESTROY_FLOW: _bindgen_ty_11 = 51;
pub const IB_USER_VERBS_EX_CMD_CREATE_WQ: _bindgen_ty_11 = 52;
pub const IB_USER_VERBS_EX_CMD_MODIFY_WQ: _bindgen_ty_11 = 53;
pub const IB_USER_VERBS_EX_CMD_DESTROY_WQ: _bindgen_ty_11 = 54;
pub const IB_USER_VERBS_EX_CMD_CREATE_RWQ_IND_TBL: _bindgen_ty_11 = 55;
pub const IB_USER_VERBS_EX_CMD_DESTROY_RWQ_IND_TBL: _bindgen_ty_11 = 56;
pub const IB_USER_VERBS_EX_CMD_MODIFY_CQ: _bindgen_ty_11 = 57;
pub type _bindgen_ty_11 = ::std::os::raw::c_uint;
pub const IB_FLUSH_GLOBAL: ib_placement_type = 1;
pub const IB_FLUSH_PERSISTENT: ib_placement_type = 2;
pub type ib_placement_type = ::std::os::raw::c_uint;
pub const IB_FLUSH_RANGE: ib_selectivity_level = 0;
pub const IB_FLUSH_MR: ib_selectivity_level = 1;
pub type ib_selectivity_level = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_async_event_desc {
    pub element: __u64,
    pub event_type: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_async_event_desc"]
        [::std::mem::size_of::<ib_uverbs_async_event_desc>() - 16usize];
    ["Alignment of ib_uverbs_async_event_desc"]
        [::std::mem::align_of::<ib_uverbs_async_event_desc>() - 8usize];
    ["Offset of field: ib_uverbs_async_event_desc::element"]
        [::std::mem::offset_of!(ib_uverbs_async_event_desc, element) - 0usize];
    ["Offset of field: ib_uverbs_async_event_desc::event_type"]
        [::std::mem::offset_of!(ib_uverbs_async_event_desc, event_type) - 8usize];
    ["Offset of field: ib_uverbs_async_event_desc::reserved"]
        [::std::mem::offset_of!(ib_uverbs_async_event_desc, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_comp_event_desc {
    pub cq_handle: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_comp_event_desc"]
        [::std::mem::size_of::<ib_uverbs_comp_event_desc>() - 8usize];
    ["Alignment of ib_uverbs_comp_event_desc"]
        [::std::mem::align_of::<ib_uverbs_comp_event_desc>() - 8usize];
    ["Offset of field: ib_uverbs_comp_event_desc::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_comp_event_desc, cq_handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_cq_moderation_caps {
    pub max_cq_moderation_count: __u16,
    pub max_cq_moderation_period: __u16,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_cq_moderation_caps"]
        [::std::mem::size_of::<ib_uverbs_cq_moderation_caps>() - 8usize];
    ["Alignment of ib_uverbs_cq_moderation_caps"]
        [::std::mem::align_of::<ib_uverbs_cq_moderation_caps>() - 4usize];
    ["Offset of field: ib_uverbs_cq_moderation_caps::max_cq_moderation_count"]
        [::std::mem::offset_of!(ib_uverbs_cq_moderation_caps, max_cq_moderation_count) - 0usize];
    ["Offset of field: ib_uverbs_cq_moderation_caps::max_cq_moderation_period"]
        [::std::mem::offset_of!(ib_uverbs_cq_moderation_caps, max_cq_moderation_period) - 2usize];
    ["Offset of field: ib_uverbs_cq_moderation_caps::reserved"]
        [::std::mem::offset_of!(ib_uverbs_cq_moderation_caps, reserved) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_cmd_hdr {
    pub command: __u32,
    pub in_words: __u16,
    pub out_words: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_cmd_hdr"][::std::mem::size_of::<ib_uverbs_cmd_hdr>() - 8usize];
    ["Alignment of ib_uverbs_cmd_hdr"][::std::mem::align_of::<ib_uverbs_cmd_hdr>() - 4usize];
    ["Offset of field: ib_uverbs_cmd_hdr::command"]
        [::std::mem::offset_of!(ib_uverbs_cmd_hdr, command) - 0usize];
    ["Offset of field: ib_uverbs_cmd_hdr::in_words"]
        [::std::mem::offset_of!(ib_uverbs_cmd_hdr, in_words) - 4usize];
    ["Offset of field: ib_uverbs_cmd_hdr::out_words"]
        [::std::mem::offset_of!(ib_uverbs_cmd_hdr, out_words) - 6usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_cmd_hdr {
    pub response: __u64,
    pub provider_in_words: __u16,
    pub provider_out_words: __u16,
    pub cmd_hdr_reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_cmd_hdr"][::std::mem::size_of::<ib_uverbs_ex_cmd_hdr>() - 16usize];
    ["Alignment of ib_uverbs_ex_cmd_hdr"][::std::mem::align_of::<ib_uverbs_ex_cmd_hdr>() - 8usize];
    ["Offset of field: ib_uverbs_ex_cmd_hdr::response"]
        [::std::mem::offset_of!(ib_uverbs_ex_cmd_hdr, response) - 0usize];
    ["Offset of field: ib_uverbs_ex_cmd_hdr::provider_in_words"]
        [::std::mem::offset_of!(ib_uverbs_ex_cmd_hdr, provider_in_words) - 8usize];
    ["Offset of field: ib_uverbs_ex_cmd_hdr::provider_out_words"]
        [::std::mem::offset_of!(ib_uverbs_ex_cmd_hdr, provider_out_words) - 10usize];
    ["Offset of field: ib_uverbs_ex_cmd_hdr::cmd_hdr_reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_cmd_hdr, cmd_hdr_reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_get_context {
    pub response: __u64,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_get_context"][::std::mem::size_of::<ib_uverbs_get_context>() - 8usize];
    ["Alignment of ib_uverbs_get_context"]
        [::std::mem::align_of::<ib_uverbs_get_context>() - 8usize];
    ["Offset of field: ib_uverbs_get_context::response"]
        [::std::mem::offset_of!(ib_uverbs_get_context, response) - 0usize];
    ["Offset of field: ib_uverbs_get_context::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_get_context, driver_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_get_context_resp {
    pub async_fd: __u32,
    pub num_comp_vectors: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_get_context_resp"]
        [::std::mem::size_of::<ib_uverbs_get_context_resp>() - 8usize];
    ["Alignment of ib_uverbs_get_context_resp"]
        [::std::mem::align_of::<ib_uverbs_get_context_resp>() - 8usize];
    ["Offset of field: ib_uverbs_get_context_resp::async_fd"]
        [::std::mem::offset_of!(ib_uverbs_get_context_resp, async_fd) - 0usize];
    ["Offset of field: ib_uverbs_get_context_resp::num_comp_vectors"]
        [::std::mem::offset_of!(ib_uverbs_get_context_resp, num_comp_vectors) - 4usize];
    ["Offset of field: ib_uverbs_get_context_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_get_context_resp, driver_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_device {
    pub response: __u64,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_device"][::std::mem::size_of::<ib_uverbs_query_device>() - 8usize];
    ["Alignment of ib_uverbs_query_device"]
        [::std::mem::align_of::<ib_uverbs_query_device>() - 8usize];
    ["Offset of field: ib_uverbs_query_device::response"]
        [::std::mem::offset_of!(ib_uverbs_query_device, response) - 0usize];
    ["Offset of field: ib_uverbs_query_device::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_query_device, driver_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_query_device_resp {
    pub fw_ver: __u64,
    pub node_guid: __be64,
    pub sys_image_guid: __be64,
    pub max_mr_size: __u64,
    pub page_size_cap: __u64,
    pub vendor_id: __u32,
    pub vendor_part_id: __u32,
    pub hw_ver: __u32,
    pub max_qp: __u32,
    pub max_qp_wr: __u32,
    pub device_cap_flags: __u32,
    pub max_sge: __u32,
    pub max_sge_rd: __u32,
    pub max_cq: __u32,
    pub max_cqe: __u32,
    pub max_mr: __u32,
    pub max_pd: __u32,
    pub max_qp_rd_atom: __u32,
    pub max_ee_rd_atom: __u32,
    pub max_res_rd_atom: __u32,
    pub max_qp_init_rd_atom: __u32,
    pub max_ee_init_rd_atom: __u32,
    pub atomic_cap: __u32,
    pub max_ee: __u32,
    pub max_rdd: __u32,
    pub max_mw: __u32,
    pub max_raw_ipv6_qp: __u32,
    pub max_raw_ethy_qp: __u32,
    pub max_mcast_grp: __u32,
    pub max_mcast_qp_attach: __u32,
    pub max_total_mcast_qp_attach: __u32,
    pub max_ah: __u32,
    pub max_fmr: __u32,
    pub max_map_per_fmr: __u32,
    pub max_srq: __u32,
    pub max_srq_wr: __u32,
    pub max_srq_sge: __u32,
    pub max_pkeys: __u16,
    pub local_ca_ack_delay: __u8,
    pub phys_port_cnt: __u8,
    pub reserved: [__u8; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_device_resp"]
        [::std::mem::size_of::<ib_uverbs_query_device_resp>() - 176usize];
    ["Alignment of ib_uverbs_query_device_resp"]
        [::std::mem::align_of::<ib_uverbs_query_device_resp>() - 8usize];
    ["Offset of field: ib_uverbs_query_device_resp::fw_ver"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, fw_ver) - 0usize];
    ["Offset of field: ib_uverbs_query_device_resp::node_guid"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, node_guid) - 8usize];
    ["Offset of field: ib_uverbs_query_device_resp::sys_image_guid"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, sys_image_guid) - 16usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_mr_size"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_mr_size) - 24usize];
    ["Offset of field: ib_uverbs_query_device_resp::page_size_cap"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, page_size_cap) - 32usize];
    ["Offset of field: ib_uverbs_query_device_resp::vendor_id"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, vendor_id) - 40usize];
    ["Offset of field: ib_uverbs_query_device_resp::vendor_part_id"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, vendor_part_id) - 44usize];
    ["Offset of field: ib_uverbs_query_device_resp::hw_ver"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, hw_ver) - 48usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_qp"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_qp) - 52usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_qp_wr"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_qp_wr) - 56usize];
    ["Offset of field: ib_uverbs_query_device_resp::device_cap_flags"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, device_cap_flags) - 60usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_sge"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_sge) - 64usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_sge_rd"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_sge_rd) - 68usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_cq"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_cq) - 72usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_cqe"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_cqe) - 76usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_mr"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_mr) - 80usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_pd"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_pd) - 84usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_qp_rd_atom"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_qp_rd_atom) - 88usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_ee_rd_atom"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_ee_rd_atom) - 92usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_res_rd_atom"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_res_rd_atom) - 96usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_qp_init_rd_atom"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_qp_init_rd_atom) - 100usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_ee_init_rd_atom"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_ee_init_rd_atom) - 104usize];
    ["Offset of field: ib_uverbs_query_device_resp::atomic_cap"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, atomic_cap) - 108usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_ee"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_ee) - 112usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_rdd"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_rdd) - 116usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_mw"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_mw) - 120usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_raw_ipv6_qp"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_raw_ipv6_qp) - 124usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_raw_ethy_qp"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_raw_ethy_qp) - 128usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_mcast_grp"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_mcast_grp) - 132usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_mcast_qp_attach"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_mcast_qp_attach) - 136usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_total_mcast_qp_attach"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_total_mcast_qp_attach) - 140usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_ah"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_ah) - 144usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_fmr"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_fmr) - 148usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_map_per_fmr"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_map_per_fmr) - 152usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_srq"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_srq) - 156usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_srq_wr"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_srq_wr) - 160usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_srq_sge"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_srq_sge) - 164usize];
    ["Offset of field: ib_uverbs_query_device_resp::max_pkeys"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, max_pkeys) - 168usize];
    ["Offset of field: ib_uverbs_query_device_resp::local_ca_ack_delay"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, local_ca_ack_delay) - 170usize];
    ["Offset of field: ib_uverbs_query_device_resp::phys_port_cnt"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, phys_port_cnt) - 171usize];
    ["Offset of field: ib_uverbs_query_device_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_query_device_resp, reserved) - 172usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_query_device {
    pub comp_mask: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_query_device"]
        [::std::mem::size_of::<ib_uverbs_ex_query_device>() - 8usize];
    ["Alignment of ib_uverbs_ex_query_device"]
        [::std::mem::align_of::<ib_uverbs_ex_query_device>() - 4usize];
    ["Offset of field: ib_uverbs_ex_query_device::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_query_device::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device, reserved) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_odp_caps {
    pub general_caps: __u64,
    pub per_transport_caps: ib_uverbs_odp_caps__bindgen_ty_1,
    pub reserved: __u32,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_odp_caps__bindgen_ty_1 {
    pub rc_odp_caps: __u32,
    pub uc_odp_caps: __u32,
    pub ud_odp_caps: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_odp_caps__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_odp_caps__bindgen_ty_1>() - 12usize];
    ["Alignment of ib_uverbs_odp_caps__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_odp_caps__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_odp_caps__bindgen_ty_1::rc_odp_caps"]
        [::std::mem::offset_of!(ib_uverbs_odp_caps__bindgen_ty_1, rc_odp_caps) - 0usize];
    ["Offset of field: ib_uverbs_odp_caps__bindgen_ty_1::uc_odp_caps"]
        [::std::mem::offset_of!(ib_uverbs_odp_caps__bindgen_ty_1, uc_odp_caps) - 4usize];
    ["Offset of field: ib_uverbs_odp_caps__bindgen_ty_1::ud_odp_caps"]
        [::std::mem::offset_of!(ib_uverbs_odp_caps__bindgen_ty_1, ud_odp_caps) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_odp_caps"][::std::mem::size_of::<ib_uverbs_odp_caps>() - 24usize];
    ["Alignment of ib_uverbs_odp_caps"][::std::mem::align_of::<ib_uverbs_odp_caps>() - 8usize];
    ["Offset of field: ib_uverbs_odp_caps::general_caps"]
        [::std::mem::offset_of!(ib_uverbs_odp_caps, general_caps) - 0usize];
    ["Offset of field: ib_uverbs_odp_caps::per_transport_caps"]
        [::std::mem::offset_of!(ib_uverbs_odp_caps, per_transport_caps) - 8usize];
    ["Offset of field: ib_uverbs_odp_caps::reserved"]
        [::std::mem::offset_of!(ib_uverbs_odp_caps, reserved) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_rss_caps {
    pub supported_qpts: __u32,
    pub max_rwq_indirection_tables: __u32,
    pub max_rwq_indirection_table_size: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_rss_caps"][::std::mem::size_of::<ib_uverbs_rss_caps>() - 16usize];
    ["Alignment of ib_uverbs_rss_caps"][::std::mem::align_of::<ib_uverbs_rss_caps>() - 4usize];
    ["Offset of field: ib_uverbs_rss_caps::supported_qpts"]
        [::std::mem::offset_of!(ib_uverbs_rss_caps, supported_qpts) - 0usize];
    ["Offset of field: ib_uverbs_rss_caps::max_rwq_indirection_tables"]
        [::std::mem::offset_of!(ib_uverbs_rss_caps, max_rwq_indirection_tables) - 4usize];
    ["Offset of field: ib_uverbs_rss_caps::max_rwq_indirection_table_size"]
        [::std::mem::offset_of!(ib_uverbs_rss_caps, max_rwq_indirection_table_size) - 8usize];
    ["Offset of field: ib_uverbs_rss_caps::reserved"]
        [::std::mem::offset_of!(ib_uverbs_rss_caps, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_tm_caps {
    pub max_rndv_hdr_size: __u32,
    pub max_num_tags: __u32,
    pub flags: __u32,
    pub max_ops: __u32,
    pub max_sge: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_tm_caps"][::std::mem::size_of::<ib_uverbs_tm_caps>() - 24usize];
    ["Alignment of ib_uverbs_tm_caps"][::std::mem::align_of::<ib_uverbs_tm_caps>() - 4usize];
    ["Offset of field: ib_uverbs_tm_caps::max_rndv_hdr_size"]
        [::std::mem::offset_of!(ib_uverbs_tm_caps, max_rndv_hdr_size) - 0usize];
    ["Offset of field: ib_uverbs_tm_caps::max_num_tags"]
        [::std::mem::offset_of!(ib_uverbs_tm_caps, max_num_tags) - 4usize];
    ["Offset of field: ib_uverbs_tm_caps::flags"]
        [::std::mem::offset_of!(ib_uverbs_tm_caps, flags) - 8usize];
    ["Offset of field: ib_uverbs_tm_caps::max_ops"]
        [::std::mem::offset_of!(ib_uverbs_tm_caps, max_ops) - 12usize];
    ["Offset of field: ib_uverbs_tm_caps::max_sge"]
        [::std::mem::offset_of!(ib_uverbs_tm_caps, max_sge) - 16usize];
    ["Offset of field: ib_uverbs_tm_caps::reserved"]
        [::std::mem::offset_of!(ib_uverbs_tm_caps, reserved) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_query_device_resp {
    pub base: ib_uverbs_query_device_resp,
    pub comp_mask: __u32,
    pub response_length: __u32,
    pub odp_caps: ib_uverbs_odp_caps,
    pub timestamp_mask: __u64,
    pub hca_core_clock: __u64,
    pub device_cap_flags_ex: __u64,
    pub rss_caps: ib_uverbs_rss_caps,
    pub max_wq_type_rq: __u32,
    pub raw_packet_caps: __u32,
    pub tm_caps: ib_uverbs_tm_caps,
    pub cq_moderation_caps: ib_uverbs_cq_moderation_caps,
    pub max_dm_size: __u64,
    pub xrc_odp_caps: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_query_device_resp"]
        [::std::mem::size_of::<ib_uverbs_ex_query_device_resp>() - 304usize];
    ["Alignment of ib_uverbs_ex_query_device_resp"]
        [::std::mem::align_of::<ib_uverbs_ex_query_device_resp>() - 8usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::base"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, base) - 0usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, comp_mask) - 176usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::response_length"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, response_length) - 180usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::odp_caps"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, odp_caps) - 184usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::timestamp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, timestamp_mask) - 208usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::hca_core_clock"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, hca_core_clock) - 216usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::device_cap_flags_ex"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, device_cap_flags_ex) - 224usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::rss_caps"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, rss_caps) - 232usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::max_wq_type_rq"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, max_wq_type_rq) - 248usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::raw_packet_caps"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, raw_packet_caps) - 252usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::tm_caps"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, tm_caps) - 256usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::cq_moderation_caps"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, cq_moderation_caps) - 280usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::max_dm_size"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, max_dm_size) - 288usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::xrc_odp_caps"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, xrc_odp_caps) - 296usize];
    ["Offset of field: ib_uverbs_ex_query_device_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_query_device_resp, reserved) - 300usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_port {
    pub response: __u64,
    pub port_num: __u8,
    pub reserved: [__u8; 7usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_port"][::std::mem::size_of::<ib_uverbs_query_port>() - 16usize];
    ["Alignment of ib_uverbs_query_port"][::std::mem::align_of::<ib_uverbs_query_port>() - 8usize];
    ["Offset of field: ib_uverbs_query_port::response"]
        [::std::mem::offset_of!(ib_uverbs_query_port, response) - 0usize];
    ["Offset of field: ib_uverbs_query_port::port_num"]
        [::std::mem::offset_of!(ib_uverbs_query_port, port_num) - 8usize];
    ["Offset of field: ib_uverbs_query_port::reserved"]
        [::std::mem::offset_of!(ib_uverbs_query_port, reserved) - 9usize];
    ["Offset of field: ib_uverbs_query_port::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_query_port, driver_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_query_port_resp {
    pub port_cap_flags: __u32,
    pub max_msg_sz: __u32,
    pub bad_pkey_cntr: __u32,
    pub qkey_viol_cntr: __u32,
    pub gid_tbl_len: __u32,
    pub pkey_tbl_len: __u16,
    pub lid: __u16,
    pub sm_lid: __u16,
    pub state: __u8,
    pub max_mtu: __u8,
    pub active_mtu: __u8,
    pub lmc: __u8,
    pub max_vl_num: __u8,
    pub sm_sl: __u8,
    pub subnet_timeout: __u8,
    pub init_type_reply: __u8,
    pub active_width: __u8,
    pub active_speed: __u8,
    pub phys_state: __u8,
    pub link_layer: __u8,
    pub flags: __u8,
    pub reserved: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_port_resp"]
        [::std::mem::size_of::<ib_uverbs_query_port_resp>() - 40usize];
    ["Alignment of ib_uverbs_query_port_resp"]
        [::std::mem::align_of::<ib_uverbs_query_port_resp>() - 4usize];
    ["Offset of field: ib_uverbs_query_port_resp::port_cap_flags"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, port_cap_flags) - 0usize];
    ["Offset of field: ib_uverbs_query_port_resp::max_msg_sz"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, max_msg_sz) - 4usize];
    ["Offset of field: ib_uverbs_query_port_resp::bad_pkey_cntr"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, bad_pkey_cntr) - 8usize];
    ["Offset of field: ib_uverbs_query_port_resp::qkey_viol_cntr"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, qkey_viol_cntr) - 12usize];
    ["Offset of field: ib_uverbs_query_port_resp::gid_tbl_len"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, gid_tbl_len) - 16usize];
    ["Offset of field: ib_uverbs_query_port_resp::pkey_tbl_len"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, pkey_tbl_len) - 20usize];
    ["Offset of field: ib_uverbs_query_port_resp::lid"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, lid) - 22usize];
    ["Offset of field: ib_uverbs_query_port_resp::sm_lid"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, sm_lid) - 24usize];
    ["Offset of field: ib_uverbs_query_port_resp::state"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, state) - 26usize];
    ["Offset of field: ib_uverbs_query_port_resp::max_mtu"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, max_mtu) - 27usize];
    ["Offset of field: ib_uverbs_query_port_resp::active_mtu"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, active_mtu) - 28usize];
    ["Offset of field: ib_uverbs_query_port_resp::lmc"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, lmc) - 29usize];
    ["Offset of field: ib_uverbs_query_port_resp::max_vl_num"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, max_vl_num) - 30usize];
    ["Offset of field: ib_uverbs_query_port_resp::sm_sl"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, sm_sl) - 31usize];
    ["Offset of field: ib_uverbs_query_port_resp::subnet_timeout"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, subnet_timeout) - 32usize];
    ["Offset of field: ib_uverbs_query_port_resp::init_type_reply"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, init_type_reply) - 33usize];
    ["Offset of field: ib_uverbs_query_port_resp::active_width"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, active_width) - 34usize];
    ["Offset of field: ib_uverbs_query_port_resp::active_speed"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, active_speed) - 35usize];
    ["Offset of field: ib_uverbs_query_port_resp::phys_state"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, phys_state) - 36usize];
    ["Offset of field: ib_uverbs_query_port_resp::link_layer"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, link_layer) - 37usize];
    ["Offset of field: ib_uverbs_query_port_resp::flags"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, flags) - 38usize];
    ["Offset of field: ib_uverbs_query_port_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp, reserved) - 39usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_alloc_pd {
    pub response: __u64,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_alloc_pd"][::std::mem::size_of::<ib_uverbs_alloc_pd>() - 8usize];
    ["Alignment of ib_uverbs_alloc_pd"][::std::mem::align_of::<ib_uverbs_alloc_pd>() - 8usize];
    ["Offset of field: ib_uverbs_alloc_pd::response"]
        [::std::mem::offset_of!(ib_uverbs_alloc_pd, response) - 0usize];
    ["Offset of field: ib_uverbs_alloc_pd::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_alloc_pd, driver_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_alloc_pd_resp {
    pub pd_handle: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_alloc_pd_resp"][::std::mem::size_of::<ib_uverbs_alloc_pd_resp>() - 4usize];
    ["Alignment of ib_uverbs_alloc_pd_resp"]
        [::std::mem::align_of::<ib_uverbs_alloc_pd_resp>() - 4usize];
    ["Offset of field: ib_uverbs_alloc_pd_resp::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_alloc_pd_resp, pd_handle) - 0usize];
    ["Offset of field: ib_uverbs_alloc_pd_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_alloc_pd_resp, driver_data) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_dealloc_pd {
    pub pd_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_dealloc_pd"][::std::mem::size_of::<ib_uverbs_dealloc_pd>() - 4usize];
    ["Alignment of ib_uverbs_dealloc_pd"][::std::mem::align_of::<ib_uverbs_dealloc_pd>() - 4usize];
    ["Offset of field: ib_uverbs_dealloc_pd::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_dealloc_pd, pd_handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_open_xrcd {
    pub response: __u64,
    pub fd: __u32,
    pub oflags: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_open_xrcd"][::std::mem::size_of::<ib_uverbs_open_xrcd>() - 16usize];
    ["Alignment of ib_uverbs_open_xrcd"][::std::mem::align_of::<ib_uverbs_open_xrcd>() - 8usize];
    ["Offset of field: ib_uverbs_open_xrcd::response"]
        [::std::mem::offset_of!(ib_uverbs_open_xrcd, response) - 0usize];
    ["Offset of field: ib_uverbs_open_xrcd::fd"]
        [::std::mem::offset_of!(ib_uverbs_open_xrcd, fd) - 8usize];
    ["Offset of field: ib_uverbs_open_xrcd::oflags"]
        [::std::mem::offset_of!(ib_uverbs_open_xrcd, oflags) - 12usize];
    ["Offset of field: ib_uverbs_open_xrcd::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_open_xrcd, driver_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_open_xrcd_resp {
    pub xrcd_handle: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_open_xrcd_resp"]
        [::std::mem::size_of::<ib_uverbs_open_xrcd_resp>() - 4usize];
    ["Alignment of ib_uverbs_open_xrcd_resp"]
        [::std::mem::align_of::<ib_uverbs_open_xrcd_resp>() - 4usize];
    ["Offset of field: ib_uverbs_open_xrcd_resp::xrcd_handle"]
        [::std::mem::offset_of!(ib_uverbs_open_xrcd_resp, xrcd_handle) - 0usize];
    ["Offset of field: ib_uverbs_open_xrcd_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_open_xrcd_resp, driver_data) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_close_xrcd {
    pub xrcd_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_close_xrcd"][::std::mem::size_of::<ib_uverbs_close_xrcd>() - 4usize];
    ["Alignment of ib_uverbs_close_xrcd"][::std::mem::align_of::<ib_uverbs_close_xrcd>() - 4usize];
    ["Offset of field: ib_uverbs_close_xrcd::xrcd_handle"]
        [::std::mem::offset_of!(ib_uverbs_close_xrcd, xrcd_handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_reg_mr {
    pub response: __u64,
    pub start: __u64,
    pub length: __u64,
    pub hca_va: __u64,
    pub pd_handle: __u32,
    pub access_flags: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_reg_mr"][::std::mem::size_of::<ib_uverbs_reg_mr>() - 40usize];
    ["Alignment of ib_uverbs_reg_mr"][::std::mem::align_of::<ib_uverbs_reg_mr>() - 8usize];
    ["Offset of field: ib_uverbs_reg_mr::response"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr, response) - 0usize];
    ["Offset of field: ib_uverbs_reg_mr::start"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr, start) - 8usize];
    ["Offset of field: ib_uverbs_reg_mr::length"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr, length) - 16usize];
    ["Offset of field: ib_uverbs_reg_mr::hca_va"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr, hca_va) - 24usize];
    ["Offset of field: ib_uverbs_reg_mr::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr, pd_handle) - 32usize];
    ["Offset of field: ib_uverbs_reg_mr::access_flags"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr, access_flags) - 36usize];
    ["Offset of field: ib_uverbs_reg_mr::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr, driver_data) - 40usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_reg_mr_resp {
    pub mr_handle: __u32,
    pub lkey: __u32,
    pub rkey: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_reg_mr_resp"][::std::mem::size_of::<ib_uverbs_reg_mr_resp>() - 12usize];
    ["Alignment of ib_uverbs_reg_mr_resp"]
        [::std::mem::align_of::<ib_uverbs_reg_mr_resp>() - 4usize];
    ["Offset of field: ib_uverbs_reg_mr_resp::mr_handle"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr_resp, mr_handle) - 0usize];
    ["Offset of field: ib_uverbs_reg_mr_resp::lkey"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr_resp, lkey) - 4usize];
    ["Offset of field: ib_uverbs_reg_mr_resp::rkey"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr_resp, rkey) - 8usize];
    ["Offset of field: ib_uverbs_reg_mr_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_reg_mr_resp, driver_data) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_rereg_mr {
    pub response: __u64,
    pub mr_handle: __u32,
    pub flags: __u32,
    pub start: __u64,
    pub length: __u64,
    pub hca_va: __u64,
    pub pd_handle: __u32,
    pub access_flags: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_rereg_mr"][::std::mem::size_of::<ib_uverbs_rereg_mr>() - 48usize];
    ["Alignment of ib_uverbs_rereg_mr"][::std::mem::align_of::<ib_uverbs_rereg_mr>() - 8usize];
    ["Offset of field: ib_uverbs_rereg_mr::response"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, response) - 0usize];
    ["Offset of field: ib_uverbs_rereg_mr::mr_handle"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, mr_handle) - 8usize];
    ["Offset of field: ib_uverbs_rereg_mr::flags"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, flags) - 12usize];
    ["Offset of field: ib_uverbs_rereg_mr::start"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, start) - 16usize];
    ["Offset of field: ib_uverbs_rereg_mr::length"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, length) - 24usize];
    ["Offset of field: ib_uverbs_rereg_mr::hca_va"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, hca_va) - 32usize];
    ["Offset of field: ib_uverbs_rereg_mr::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, pd_handle) - 40usize];
    ["Offset of field: ib_uverbs_rereg_mr::access_flags"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, access_flags) - 44usize];
    ["Offset of field: ib_uverbs_rereg_mr::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr, driver_data) - 48usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_rereg_mr_resp {
    pub lkey: __u32,
    pub rkey: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_rereg_mr_resp"][::std::mem::size_of::<ib_uverbs_rereg_mr_resp>() - 8usize];
    ["Alignment of ib_uverbs_rereg_mr_resp"]
        [::std::mem::align_of::<ib_uverbs_rereg_mr_resp>() - 8usize];
    ["Offset of field: ib_uverbs_rereg_mr_resp::lkey"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr_resp, lkey) - 0usize];
    ["Offset of field: ib_uverbs_rereg_mr_resp::rkey"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr_resp, rkey) - 4usize];
    ["Offset of field: ib_uverbs_rereg_mr_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_rereg_mr_resp, driver_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_dereg_mr {
    pub mr_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_dereg_mr"][::std::mem::size_of::<ib_uverbs_dereg_mr>() - 4usize];
    ["Alignment of ib_uverbs_dereg_mr"][::std::mem::align_of::<ib_uverbs_dereg_mr>() - 4usize];
    ["Offset of field: ib_uverbs_dereg_mr::mr_handle"]
        [::std::mem::offset_of!(ib_uverbs_dereg_mr, mr_handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_alloc_mw {
    pub response: __u64,
    pub pd_handle: __u32,
    pub mw_type: __u8,
    pub reserved: [__u8; 3usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_alloc_mw"][::std::mem::size_of::<ib_uverbs_alloc_mw>() - 16usize];
    ["Alignment of ib_uverbs_alloc_mw"][::std::mem::align_of::<ib_uverbs_alloc_mw>() - 8usize];
    ["Offset of field: ib_uverbs_alloc_mw::response"]
        [::std::mem::offset_of!(ib_uverbs_alloc_mw, response) - 0usize];
    ["Offset of field: ib_uverbs_alloc_mw::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_alloc_mw, pd_handle) - 8usize];
    ["Offset of field: ib_uverbs_alloc_mw::mw_type"]
        [::std::mem::offset_of!(ib_uverbs_alloc_mw, mw_type) - 12usize];
    ["Offset of field: ib_uverbs_alloc_mw::reserved"]
        [::std::mem::offset_of!(ib_uverbs_alloc_mw, reserved) - 13usize];
    ["Offset of field: ib_uverbs_alloc_mw::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_alloc_mw, driver_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_alloc_mw_resp {
    pub mw_handle: __u32,
    pub rkey: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_alloc_mw_resp"][::std::mem::size_of::<ib_uverbs_alloc_mw_resp>() - 8usize];
    ["Alignment of ib_uverbs_alloc_mw_resp"]
        [::std::mem::align_of::<ib_uverbs_alloc_mw_resp>() - 8usize];
    ["Offset of field: ib_uverbs_alloc_mw_resp::mw_handle"]
        [::std::mem::offset_of!(ib_uverbs_alloc_mw_resp, mw_handle) - 0usize];
    ["Offset of field: ib_uverbs_alloc_mw_resp::rkey"]
        [::std::mem::offset_of!(ib_uverbs_alloc_mw_resp, rkey) - 4usize];
    ["Offset of field: ib_uverbs_alloc_mw_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_alloc_mw_resp, driver_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_dealloc_mw {
    pub mw_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_dealloc_mw"][::std::mem::size_of::<ib_uverbs_dealloc_mw>() - 4usize];
    ["Alignment of ib_uverbs_dealloc_mw"][::std::mem::align_of::<ib_uverbs_dealloc_mw>() - 4usize];
    ["Offset of field: ib_uverbs_dealloc_mw::mw_handle"]
        [::std::mem::offset_of!(ib_uverbs_dealloc_mw, mw_handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_create_comp_channel {
    pub response: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_comp_channel"]
        [::std::mem::size_of::<ib_uverbs_create_comp_channel>() - 8usize];
    ["Alignment of ib_uverbs_create_comp_channel"]
        [::std::mem::align_of::<ib_uverbs_create_comp_channel>() - 8usize];
    ["Offset of field: ib_uverbs_create_comp_channel::response"]
        [::std::mem::offset_of!(ib_uverbs_create_comp_channel, response) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_create_comp_channel_resp {
    pub fd: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_comp_channel_resp"]
        [::std::mem::size_of::<ib_uverbs_create_comp_channel_resp>() - 4usize];
    ["Alignment of ib_uverbs_create_comp_channel_resp"]
        [::std::mem::align_of::<ib_uverbs_create_comp_channel_resp>() - 4usize];
    ["Offset of field: ib_uverbs_create_comp_channel_resp::fd"]
        [::std::mem::offset_of!(ib_uverbs_create_comp_channel_resp, fd) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_cq {
    pub response: __u64,
    pub user_handle: __u64,
    pub cqe: __u32,
    pub comp_vector: __u32,
    pub comp_channel: __s32,
    pub reserved: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_cq"][::std::mem::size_of::<ib_uverbs_create_cq>() - 32usize];
    ["Alignment of ib_uverbs_create_cq"][::std::mem::align_of::<ib_uverbs_create_cq>() - 8usize];
    ["Offset of field: ib_uverbs_create_cq::response"]
        [::std::mem::offset_of!(ib_uverbs_create_cq, response) - 0usize];
    ["Offset of field: ib_uverbs_create_cq::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_cq, user_handle) - 8usize];
    ["Offset of field: ib_uverbs_create_cq::cqe"]
        [::std::mem::offset_of!(ib_uverbs_create_cq, cqe) - 16usize];
    ["Offset of field: ib_uverbs_create_cq::comp_vector"]
        [::std::mem::offset_of!(ib_uverbs_create_cq, comp_vector) - 20usize];
    ["Offset of field: ib_uverbs_create_cq::comp_channel"]
        [::std::mem::offset_of!(ib_uverbs_create_cq, comp_channel) - 24usize];
    ["Offset of field: ib_uverbs_create_cq::reserved"]
        [::std::mem::offset_of!(ib_uverbs_create_cq, reserved) - 28usize];
    ["Offset of field: ib_uverbs_create_cq::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_cq, driver_data) - 32usize];
};
pub const IB_UVERBS_CQ_FLAGS_TIMESTAMP_COMPLETION: ib_uverbs_ex_create_cq_flags = 1;
pub const IB_UVERBS_CQ_FLAGS_IGNORE_OVERRUN: ib_uverbs_ex_create_cq_flags = 2;
pub type ib_uverbs_ex_create_cq_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_create_cq {
    pub user_handle: __u64,
    pub cqe: __u32,
    pub comp_vector: __u32,
    pub comp_channel: __s32,
    pub comp_mask: __u32,
    pub flags: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_create_cq"][::std::mem::size_of::<ib_uverbs_ex_create_cq>() - 32usize];
    ["Alignment of ib_uverbs_ex_create_cq"]
        [::std::mem::align_of::<ib_uverbs_ex_create_cq>() - 8usize];
    ["Offset of field: ib_uverbs_ex_create_cq::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq, user_handle) - 0usize];
    ["Offset of field: ib_uverbs_ex_create_cq::cqe"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq, cqe) - 8usize];
    ["Offset of field: ib_uverbs_ex_create_cq::comp_vector"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq, comp_vector) - 12usize];
    ["Offset of field: ib_uverbs_ex_create_cq::comp_channel"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq, comp_channel) - 16usize];
    ["Offset of field: ib_uverbs_ex_create_cq::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq, comp_mask) - 20usize];
    ["Offset of field: ib_uverbs_ex_create_cq::flags"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq, flags) - 24usize];
    ["Offset of field: ib_uverbs_ex_create_cq::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq, reserved) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_cq_resp {
    pub cq_handle: __u32,
    pub cqe: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_cq_resp"]
        [::std::mem::size_of::<ib_uverbs_create_cq_resp>() - 8usize];
    ["Alignment of ib_uverbs_create_cq_resp"]
        [::std::mem::align_of::<ib_uverbs_create_cq_resp>() - 8usize];
    ["Offset of field: ib_uverbs_create_cq_resp::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_cq_resp, cq_handle) - 0usize];
    ["Offset of field: ib_uverbs_create_cq_resp::cqe"]
        [::std::mem::offset_of!(ib_uverbs_create_cq_resp, cqe) - 4usize];
    ["Offset of field: ib_uverbs_create_cq_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_cq_resp, driver_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_ex_create_cq_resp {
    pub base: ib_uverbs_create_cq_resp,
    pub comp_mask: __u32,
    pub response_length: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_create_cq_resp"]
        [::std::mem::size_of::<ib_uverbs_ex_create_cq_resp>() - 16usize];
    ["Alignment of ib_uverbs_ex_create_cq_resp"]
        [::std::mem::align_of::<ib_uverbs_ex_create_cq_resp>() - 8usize];
    ["Offset of field: ib_uverbs_ex_create_cq_resp::base"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq_resp, base) - 0usize];
    ["Offset of field: ib_uverbs_ex_create_cq_resp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq_resp, comp_mask) - 8usize];
    ["Offset of field: ib_uverbs_ex_create_cq_resp::response_length"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_cq_resp, response_length) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_resize_cq {
    pub response: __u64,
    pub cq_handle: __u32,
    pub cqe: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_resize_cq"][::std::mem::size_of::<ib_uverbs_resize_cq>() - 16usize];
    ["Alignment of ib_uverbs_resize_cq"][::std::mem::align_of::<ib_uverbs_resize_cq>() - 8usize];
    ["Offset of field: ib_uverbs_resize_cq::response"]
        [::std::mem::offset_of!(ib_uverbs_resize_cq, response) - 0usize];
    ["Offset of field: ib_uverbs_resize_cq::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_resize_cq, cq_handle) - 8usize];
    ["Offset of field: ib_uverbs_resize_cq::cqe"]
        [::std::mem::offset_of!(ib_uverbs_resize_cq, cqe) - 12usize];
    ["Offset of field: ib_uverbs_resize_cq::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_resize_cq, driver_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_resize_cq_resp {
    pub cqe: __u32,
    pub reserved: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_resize_cq_resp"]
        [::std::mem::size_of::<ib_uverbs_resize_cq_resp>() - 8usize];
    ["Alignment of ib_uverbs_resize_cq_resp"]
        [::std::mem::align_of::<ib_uverbs_resize_cq_resp>() - 8usize];
    ["Offset of field: ib_uverbs_resize_cq_resp::cqe"]
        [::std::mem::offset_of!(ib_uverbs_resize_cq_resp, cqe) - 0usize];
    ["Offset of field: ib_uverbs_resize_cq_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_resize_cq_resp, reserved) - 4usize];
    ["Offset of field: ib_uverbs_resize_cq_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_resize_cq_resp, driver_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_poll_cq {
    pub response: __u64,
    pub cq_handle: __u32,
    pub ne: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_poll_cq"][::std::mem::size_of::<ib_uverbs_poll_cq>() - 16usize];
    ["Alignment of ib_uverbs_poll_cq"][::std::mem::align_of::<ib_uverbs_poll_cq>() - 8usize];
    ["Offset of field: ib_uverbs_poll_cq::response"]
        [::std::mem::offset_of!(ib_uverbs_poll_cq, response) - 0usize];
    ["Offset of field: ib_uverbs_poll_cq::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_poll_cq, cq_handle) - 8usize];
    ["Offset of field: ib_uverbs_poll_cq::ne"]
        [::std::mem::offset_of!(ib_uverbs_poll_cq, ne) - 12usize];
};
pub const IB_UVERBS_WC_SEND: ib_uverbs_wc_opcode = 0;
pub const IB_UVERBS_WC_RDMA_WRITE: ib_uverbs_wc_opcode = 1;
pub const IB_UVERBS_WC_RDMA_READ: ib_uverbs_wc_opcode = 2;
pub const IB_UVERBS_WC_COMP_SWAP: ib_uverbs_wc_opcode = 3;
pub const IB_UVERBS_WC_FETCH_ADD: ib_uverbs_wc_opcode = 4;
pub const IB_UVERBS_WC_BIND_MW: ib_uverbs_wc_opcode = 5;
pub const IB_UVERBS_WC_LOCAL_INV: ib_uverbs_wc_opcode = 6;
pub const IB_UVERBS_WC_TSO: ib_uverbs_wc_opcode = 7;
pub const IB_UVERBS_WC_FLUSH: ib_uverbs_wc_opcode = 8;
pub const IB_UVERBS_WC_ATOMIC_WRITE: ib_uverbs_wc_opcode = 9;
pub type ib_uverbs_wc_opcode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ib_uverbs_wc {
    pub wr_id: __u64,
    pub status: __u32,
    pub opcode: __u32,
    pub vendor_err: __u32,
    pub byte_len: __u32,
    pub ex: ib_uverbs_wc__bindgen_ty_1,
    pub qp_num: __u32,
    pub src_qp: __u32,
    pub wc_flags: __u32,
    pub pkey_index: __u16,
    pub slid: __u16,
    pub sl: __u8,
    pub dlid_path_bits: __u8,
    pub port_num: __u8,
    pub reserved: __u8,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_wc__bindgen_ty_1 {
    pub imm_data: __be32,
    pub invalidate_rkey: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_wc__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_wc__bindgen_ty_1>() - 4usize];
    ["Alignment of ib_uverbs_wc__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_wc__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_wc__bindgen_ty_1::imm_data"]
        [::std::mem::offset_of!(ib_uverbs_wc__bindgen_ty_1, imm_data) - 0usize];
    ["Offset of field: ib_uverbs_wc__bindgen_ty_1::invalidate_rkey"]
        [::std::mem::offset_of!(ib_uverbs_wc__bindgen_ty_1, invalidate_rkey) - 0usize];
};
impl Default for ib_uverbs_wc__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_wc"][::std::mem::size_of::<ib_uverbs_wc>() - 48usize];
    ["Alignment of ib_uverbs_wc"][::std::mem::align_of::<ib_uverbs_wc>() - 8usize];
    ["Offset of field: ib_uverbs_wc::wr_id"][::std::mem::offset_of!(ib_uverbs_wc, wr_id) - 0usize];
    ["Offset of field: ib_uverbs_wc::status"]
        [::std::mem::offset_of!(ib_uverbs_wc, status) - 8usize];
    ["Offset of field: ib_uverbs_wc::opcode"]
        [::std::mem::offset_of!(ib_uverbs_wc, opcode) - 12usize];
    ["Offset of field: ib_uverbs_wc::vendor_err"]
        [::std::mem::offset_of!(ib_uverbs_wc, vendor_err) - 16usize];
    ["Offset of field: ib_uverbs_wc::byte_len"]
        [::std::mem::offset_of!(ib_uverbs_wc, byte_len) - 20usize];
    ["Offset of field: ib_uverbs_wc::ex"][::std::mem::offset_of!(ib_uverbs_wc, ex) - 24usize];
    ["Offset of field: ib_uverbs_wc::qp_num"]
        [::std::mem::offset_of!(ib_uverbs_wc, qp_num) - 28usize];
    ["Offset of field: ib_uverbs_wc::src_qp"]
        [::std::mem::offset_of!(ib_uverbs_wc, src_qp) - 32usize];
    ["Offset of field: ib_uverbs_wc::wc_flags"]
        [::std::mem::offset_of!(ib_uverbs_wc, wc_flags) - 36usize];
    ["Offset of field: ib_uverbs_wc::pkey_index"]
        [::std::mem::offset_of!(ib_uverbs_wc, pkey_index) - 40usize];
    ["Offset of field: ib_uverbs_wc::slid"][::std::mem::offset_of!(ib_uverbs_wc, slid) - 42usize];
    ["Offset of field: ib_uverbs_wc::sl"][::std::mem::offset_of!(ib_uverbs_wc, sl) - 44usize];
    ["Offset of field: ib_uverbs_wc::dlid_path_bits"]
        [::std::mem::offset_of!(ib_uverbs_wc, dlid_path_bits) - 45usize];
    ["Offset of field: ib_uverbs_wc::port_num"]
        [::std::mem::offset_of!(ib_uverbs_wc, port_num) - 46usize];
    ["Offset of field: ib_uverbs_wc::reserved"]
        [::std::mem::offset_of!(ib_uverbs_wc, reserved) - 47usize];
};
impl Default for ib_uverbs_wc {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct ib_uverbs_poll_cq_resp {
    pub count: __u32,
    pub reserved: __u32,
    pub wc: __IncompleteArrayField<ib_uverbs_wc>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_poll_cq_resp"][::std::mem::size_of::<ib_uverbs_poll_cq_resp>() - 8usize];
    ["Alignment of ib_uverbs_poll_cq_resp"]
        [::std::mem::align_of::<ib_uverbs_poll_cq_resp>() - 8usize];
    ["Offset of field: ib_uverbs_poll_cq_resp::count"]
        [::std::mem::offset_of!(ib_uverbs_poll_cq_resp, count) - 0usize];
    ["Offset of field: ib_uverbs_poll_cq_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_poll_cq_resp, reserved) - 4usize];
    ["Offset of field: ib_uverbs_poll_cq_resp::wc"]
        [::std::mem::offset_of!(ib_uverbs_poll_cq_resp, wc) - 8usize];
};
impl Default for ib_uverbs_poll_cq_resp {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_req_notify_cq {
    pub cq_handle: __u32,
    pub solicited_only: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_req_notify_cq"][::std::mem::size_of::<ib_uverbs_req_notify_cq>() - 8usize];
    ["Alignment of ib_uverbs_req_notify_cq"]
        [::std::mem::align_of::<ib_uverbs_req_notify_cq>() - 4usize];
    ["Offset of field: ib_uverbs_req_notify_cq::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_req_notify_cq, cq_handle) - 0usize];
    ["Offset of field: ib_uverbs_req_notify_cq::solicited_only"]
        [::std::mem::offset_of!(ib_uverbs_req_notify_cq, solicited_only) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_cq {
    pub response: __u64,
    pub cq_handle: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_destroy_cq"][::std::mem::size_of::<ib_uverbs_destroy_cq>() - 16usize];
    ["Alignment of ib_uverbs_destroy_cq"][::std::mem::align_of::<ib_uverbs_destroy_cq>() - 8usize];
    ["Offset of field: ib_uverbs_destroy_cq::response"]
        [::std::mem::offset_of!(ib_uverbs_destroy_cq, response) - 0usize];
    ["Offset of field: ib_uverbs_destroy_cq::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_destroy_cq, cq_handle) - 8usize];
    ["Offset of field: ib_uverbs_destroy_cq::reserved"]
        [::std::mem::offset_of!(ib_uverbs_destroy_cq, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_cq_resp {
    pub comp_events_reported: __u32,
    pub async_events_reported: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_destroy_cq_resp"]
        [::std::mem::size_of::<ib_uverbs_destroy_cq_resp>() - 8usize];
    ["Alignment of ib_uverbs_destroy_cq_resp"]
        [::std::mem::align_of::<ib_uverbs_destroy_cq_resp>() - 4usize];
    ["Offset of field: ib_uverbs_destroy_cq_resp::comp_events_reported"]
        [::std::mem::offset_of!(ib_uverbs_destroy_cq_resp, comp_events_reported) - 0usize];
    ["Offset of field: ib_uverbs_destroy_cq_resp::async_events_reported"]
        [::std::mem::offset_of!(ib_uverbs_destroy_cq_resp, async_events_reported) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_global_route {
    pub dgid: [__u8; 16usize],
    pub flow_label: __u32,
    pub sgid_index: __u8,
    pub hop_limit: __u8,
    pub traffic_class: __u8,
    pub reserved: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_global_route"][::std::mem::size_of::<ib_uverbs_global_route>() - 24usize];
    ["Alignment of ib_uverbs_global_route"]
        [::std::mem::align_of::<ib_uverbs_global_route>() - 4usize];
    ["Offset of field: ib_uverbs_global_route::dgid"]
        [::std::mem::offset_of!(ib_uverbs_global_route, dgid) - 0usize];
    ["Offset of field: ib_uverbs_global_route::flow_label"]
        [::std::mem::offset_of!(ib_uverbs_global_route, flow_label) - 16usize];
    ["Offset of field: ib_uverbs_global_route::sgid_index"]
        [::std::mem::offset_of!(ib_uverbs_global_route, sgid_index) - 20usize];
    ["Offset of field: ib_uverbs_global_route::hop_limit"]
        [::std::mem::offset_of!(ib_uverbs_global_route, hop_limit) - 21usize];
    ["Offset of field: ib_uverbs_global_route::traffic_class"]
        [::std::mem::offset_of!(ib_uverbs_global_route, traffic_class) - 22usize];
    ["Offset of field: ib_uverbs_global_route::reserved"]
        [::std::mem::offset_of!(ib_uverbs_global_route, reserved) - 23usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ah_attr {
    pub grh: ib_uverbs_global_route,
    pub dlid: __u16,
    pub sl: __u8,
    pub src_path_bits: __u8,
    pub static_rate: __u8,
    pub is_global: __u8,
    pub port_num: __u8,
    pub reserved: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ah_attr"][::std::mem::size_of::<ib_uverbs_ah_attr>() - 32usize];
    ["Alignment of ib_uverbs_ah_attr"][::std::mem::align_of::<ib_uverbs_ah_attr>() - 4usize];
    ["Offset of field: ib_uverbs_ah_attr::grh"]
        [::std::mem::offset_of!(ib_uverbs_ah_attr, grh) - 0usize];
    ["Offset of field: ib_uverbs_ah_attr::dlid"]
        [::std::mem::offset_of!(ib_uverbs_ah_attr, dlid) - 24usize];
    ["Offset of field: ib_uverbs_ah_attr::sl"]
        [::std::mem::offset_of!(ib_uverbs_ah_attr, sl) - 26usize];
    ["Offset of field: ib_uverbs_ah_attr::src_path_bits"]
        [::std::mem::offset_of!(ib_uverbs_ah_attr, src_path_bits) - 27usize];
    ["Offset of field: ib_uverbs_ah_attr::static_rate"]
        [::std::mem::offset_of!(ib_uverbs_ah_attr, static_rate) - 28usize];
    ["Offset of field: ib_uverbs_ah_attr::is_global"]
        [::std::mem::offset_of!(ib_uverbs_ah_attr, is_global) - 29usize];
    ["Offset of field: ib_uverbs_ah_attr::port_num"]
        [::std::mem::offset_of!(ib_uverbs_ah_attr, port_num) - 30usize];
    ["Offset of field: ib_uverbs_ah_attr::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ah_attr, reserved) - 31usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_qp_attr {
    pub qp_attr_mask: __u32,
    pub qp_state: __u32,
    pub cur_qp_state: __u32,
    pub path_mtu: __u32,
    pub path_mig_state: __u32,
    pub qkey: __u32,
    pub rq_psn: __u32,
    pub sq_psn: __u32,
    pub dest_qp_num: __u32,
    pub qp_access_flags: __u32,
    pub ah_attr: ib_uverbs_ah_attr,
    pub alt_ah_attr: ib_uverbs_ah_attr,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub pkey_index: __u16,
    pub alt_pkey_index: __u16,
    pub en_sqd_async_notify: __u8,
    pub sq_draining: __u8,
    pub max_rd_atomic: __u8,
    pub max_dest_rd_atomic: __u8,
    pub min_rnr_timer: __u8,
    pub port_num: __u8,
    pub timeout: __u8,
    pub retry_cnt: __u8,
    pub rnr_retry: __u8,
    pub alt_port_num: __u8,
    pub alt_timeout: __u8,
    pub reserved: [__u8; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_qp_attr"][::std::mem::size_of::<ib_uverbs_qp_attr>() - 144usize];
    ["Alignment of ib_uverbs_qp_attr"][::std::mem::align_of::<ib_uverbs_qp_attr>() - 4usize];
    ["Offset of field: ib_uverbs_qp_attr::qp_attr_mask"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, qp_attr_mask) - 0usize];
    ["Offset of field: ib_uverbs_qp_attr::qp_state"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, qp_state) - 4usize];
    ["Offset of field: ib_uverbs_qp_attr::cur_qp_state"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, cur_qp_state) - 8usize];
    ["Offset of field: ib_uverbs_qp_attr::path_mtu"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, path_mtu) - 12usize];
    ["Offset of field: ib_uverbs_qp_attr::path_mig_state"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, path_mig_state) - 16usize];
    ["Offset of field: ib_uverbs_qp_attr::qkey"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, qkey) - 20usize];
    ["Offset of field: ib_uverbs_qp_attr::rq_psn"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, rq_psn) - 24usize];
    ["Offset of field: ib_uverbs_qp_attr::sq_psn"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, sq_psn) - 28usize];
    ["Offset of field: ib_uverbs_qp_attr::dest_qp_num"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, dest_qp_num) - 32usize];
    ["Offset of field: ib_uverbs_qp_attr::qp_access_flags"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, qp_access_flags) - 36usize];
    ["Offset of field: ib_uverbs_qp_attr::ah_attr"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, ah_attr) - 40usize];
    ["Offset of field: ib_uverbs_qp_attr::alt_ah_attr"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, alt_ah_attr) - 72usize];
    ["Offset of field: ib_uverbs_qp_attr::max_send_wr"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, max_send_wr) - 104usize];
    ["Offset of field: ib_uverbs_qp_attr::max_recv_wr"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, max_recv_wr) - 108usize];
    ["Offset of field: ib_uverbs_qp_attr::max_send_sge"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, max_send_sge) - 112usize];
    ["Offset of field: ib_uverbs_qp_attr::max_recv_sge"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, max_recv_sge) - 116usize];
    ["Offset of field: ib_uverbs_qp_attr::max_inline_data"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, max_inline_data) - 120usize];
    ["Offset of field: ib_uverbs_qp_attr::pkey_index"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, pkey_index) - 124usize];
    ["Offset of field: ib_uverbs_qp_attr::alt_pkey_index"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, alt_pkey_index) - 126usize];
    ["Offset of field: ib_uverbs_qp_attr::en_sqd_async_notify"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, en_sqd_async_notify) - 128usize];
    ["Offset of field: ib_uverbs_qp_attr::sq_draining"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, sq_draining) - 129usize];
    ["Offset of field: ib_uverbs_qp_attr::max_rd_atomic"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, max_rd_atomic) - 130usize];
    ["Offset of field: ib_uverbs_qp_attr::max_dest_rd_atomic"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, max_dest_rd_atomic) - 131usize];
    ["Offset of field: ib_uverbs_qp_attr::min_rnr_timer"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, min_rnr_timer) - 132usize];
    ["Offset of field: ib_uverbs_qp_attr::port_num"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, port_num) - 133usize];
    ["Offset of field: ib_uverbs_qp_attr::timeout"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, timeout) - 134usize];
    ["Offset of field: ib_uverbs_qp_attr::retry_cnt"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, retry_cnt) - 135usize];
    ["Offset of field: ib_uverbs_qp_attr::rnr_retry"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, rnr_retry) - 136usize];
    ["Offset of field: ib_uverbs_qp_attr::alt_port_num"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, alt_port_num) - 137usize];
    ["Offset of field: ib_uverbs_qp_attr::alt_timeout"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, alt_timeout) - 138usize];
    ["Offset of field: ib_uverbs_qp_attr::reserved"]
        [::std::mem::offset_of!(ib_uverbs_qp_attr, reserved) - 139usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_qp {
    pub response: __u64,
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub send_cq_handle: __u32,
    pub recv_cq_handle: __u32,
    pub srq_handle: __u32,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub sq_sig_all: __u8,
    pub qp_type: __u8,
    pub is_srq: __u8,
    pub reserved: __u8,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_qp"][::std::mem::size_of::<ib_uverbs_create_qp>() - 56usize];
    ["Alignment of ib_uverbs_create_qp"][::std::mem::align_of::<ib_uverbs_create_qp>() - 8usize];
    ["Offset of field: ib_uverbs_create_qp::response"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, response) - 0usize];
    ["Offset of field: ib_uverbs_create_qp::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, user_handle) - 8usize];
    ["Offset of field: ib_uverbs_create_qp::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, pd_handle) - 16usize];
    ["Offset of field: ib_uverbs_create_qp::send_cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, send_cq_handle) - 20usize];
    ["Offset of field: ib_uverbs_create_qp::recv_cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, recv_cq_handle) - 24usize];
    ["Offset of field: ib_uverbs_create_qp::srq_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, srq_handle) - 28usize];
    ["Offset of field: ib_uverbs_create_qp::max_send_wr"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, max_send_wr) - 32usize];
    ["Offset of field: ib_uverbs_create_qp::max_recv_wr"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, max_recv_wr) - 36usize];
    ["Offset of field: ib_uverbs_create_qp::max_send_sge"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, max_send_sge) - 40usize];
    ["Offset of field: ib_uverbs_create_qp::max_recv_sge"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, max_recv_sge) - 44usize];
    ["Offset of field: ib_uverbs_create_qp::max_inline_data"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, max_inline_data) - 48usize];
    ["Offset of field: ib_uverbs_create_qp::sq_sig_all"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, sq_sig_all) - 52usize];
    ["Offset of field: ib_uverbs_create_qp::qp_type"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, qp_type) - 53usize];
    ["Offset of field: ib_uverbs_create_qp::is_srq"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, is_srq) - 54usize];
    ["Offset of field: ib_uverbs_create_qp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, reserved) - 55usize];
    ["Offset of field: ib_uverbs_create_qp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_qp, driver_data) - 56usize];
};
pub const IB_UVERBS_CREATE_QP_MASK_IND_TABLE: ib_uverbs_create_qp_mask = 1;
pub type ib_uverbs_create_qp_mask = ::std::os::raw::c_uint;
pub const IB_UVERBS_CREATE_QP_SUP_COMP_MASK: _bindgen_ty_12 = 1;
pub type _bindgen_ty_12 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_create_qp {
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub send_cq_handle: __u32,
    pub recv_cq_handle: __u32,
    pub srq_handle: __u32,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub sq_sig_all: __u8,
    pub qp_type: __u8,
    pub is_srq: __u8,
    pub reserved: __u8,
    pub comp_mask: __u32,
    pub create_flags: __u32,
    pub rwq_ind_tbl_handle: __u32,
    pub source_qpn: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_create_qp"][::std::mem::size_of::<ib_uverbs_ex_create_qp>() - 64usize];
    ["Alignment of ib_uverbs_ex_create_qp"]
        [::std::mem::align_of::<ib_uverbs_ex_create_qp>() - 8usize];
    ["Offset of field: ib_uverbs_ex_create_qp::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, user_handle) - 0usize];
    ["Offset of field: ib_uverbs_ex_create_qp::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, pd_handle) - 8usize];
    ["Offset of field: ib_uverbs_ex_create_qp::send_cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, send_cq_handle) - 12usize];
    ["Offset of field: ib_uverbs_ex_create_qp::recv_cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, recv_cq_handle) - 16usize];
    ["Offset of field: ib_uverbs_ex_create_qp::srq_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, srq_handle) - 20usize];
    ["Offset of field: ib_uverbs_ex_create_qp::max_send_wr"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, max_send_wr) - 24usize];
    ["Offset of field: ib_uverbs_ex_create_qp::max_recv_wr"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, max_recv_wr) - 28usize];
    ["Offset of field: ib_uverbs_ex_create_qp::max_send_sge"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, max_send_sge) - 32usize];
    ["Offset of field: ib_uverbs_ex_create_qp::max_recv_sge"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, max_recv_sge) - 36usize];
    ["Offset of field: ib_uverbs_ex_create_qp::max_inline_data"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, max_inline_data) - 40usize];
    ["Offset of field: ib_uverbs_ex_create_qp::sq_sig_all"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, sq_sig_all) - 44usize];
    ["Offset of field: ib_uverbs_ex_create_qp::qp_type"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, qp_type) - 45usize];
    ["Offset of field: ib_uverbs_ex_create_qp::is_srq"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, is_srq) - 46usize];
    ["Offset of field: ib_uverbs_ex_create_qp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, reserved) - 47usize];
    ["Offset of field: ib_uverbs_ex_create_qp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, comp_mask) - 48usize];
    ["Offset of field: ib_uverbs_ex_create_qp::create_flags"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, create_flags) - 52usize];
    ["Offset of field: ib_uverbs_ex_create_qp::rwq_ind_tbl_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, rwq_ind_tbl_handle) - 56usize];
    ["Offset of field: ib_uverbs_ex_create_qp::source_qpn"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp, source_qpn) - 60usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_open_qp {
    pub response: __u64,
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub qpn: __u32,
    pub qp_type: __u8,
    pub reserved: [__u8; 7usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_open_qp"][::std::mem::size_of::<ib_uverbs_open_qp>() - 32usize];
    ["Alignment of ib_uverbs_open_qp"][::std::mem::align_of::<ib_uverbs_open_qp>() - 8usize];
    ["Offset of field: ib_uverbs_open_qp::response"]
        [::std::mem::offset_of!(ib_uverbs_open_qp, response) - 0usize];
    ["Offset of field: ib_uverbs_open_qp::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_open_qp, user_handle) - 8usize];
    ["Offset of field: ib_uverbs_open_qp::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_open_qp, pd_handle) - 16usize];
    ["Offset of field: ib_uverbs_open_qp::qpn"]
        [::std::mem::offset_of!(ib_uverbs_open_qp, qpn) - 20usize];
    ["Offset of field: ib_uverbs_open_qp::qp_type"]
        [::std::mem::offset_of!(ib_uverbs_open_qp, qp_type) - 24usize];
    ["Offset of field: ib_uverbs_open_qp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_open_qp, reserved) - 25usize];
    ["Offset of field: ib_uverbs_open_qp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_open_qp, driver_data) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_qp_resp {
    pub qp_handle: __u32,
    pub qpn: __u32,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub reserved: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_qp_resp"]
        [::std::mem::size_of::<ib_uverbs_create_qp_resp>() - 32usize];
    ["Alignment of ib_uverbs_create_qp_resp"]
        [::std::mem::align_of::<ib_uverbs_create_qp_resp>() - 4usize];
    ["Offset of field: ib_uverbs_create_qp_resp::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, qp_handle) - 0usize];
    ["Offset of field: ib_uverbs_create_qp_resp::qpn"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, qpn) - 4usize];
    ["Offset of field: ib_uverbs_create_qp_resp::max_send_wr"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, max_send_wr) - 8usize];
    ["Offset of field: ib_uverbs_create_qp_resp::max_recv_wr"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, max_recv_wr) - 12usize];
    ["Offset of field: ib_uverbs_create_qp_resp::max_send_sge"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, max_send_sge) - 16usize];
    ["Offset of field: ib_uverbs_create_qp_resp::max_recv_sge"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, max_recv_sge) - 20usize];
    ["Offset of field: ib_uverbs_create_qp_resp::max_inline_data"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, max_inline_data) - 24usize];
    ["Offset of field: ib_uverbs_create_qp_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, reserved) - 28usize];
    ["Offset of field: ib_uverbs_create_qp_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_qp_resp, driver_data) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_ex_create_qp_resp {
    pub base: ib_uverbs_create_qp_resp,
    pub comp_mask: __u32,
    pub response_length: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_create_qp_resp"]
        [::std::mem::size_of::<ib_uverbs_ex_create_qp_resp>() - 40usize];
    ["Alignment of ib_uverbs_ex_create_qp_resp"]
        [::std::mem::align_of::<ib_uverbs_ex_create_qp_resp>() - 4usize];
    ["Offset of field: ib_uverbs_ex_create_qp_resp::base"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp_resp, base) - 0usize];
    ["Offset of field: ib_uverbs_ex_create_qp_resp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp_resp, comp_mask) - 32usize];
    ["Offset of field: ib_uverbs_ex_create_qp_resp::response_length"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_qp_resp, response_length) - 36usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_qp_dest {
    pub dgid: [__u8; 16usize],
    pub flow_label: __u32,
    pub dlid: __u16,
    pub reserved: __u16,
    pub sgid_index: __u8,
    pub hop_limit: __u8,
    pub traffic_class: __u8,
    pub sl: __u8,
    pub src_path_bits: __u8,
    pub static_rate: __u8,
    pub is_global: __u8,
    pub port_num: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_qp_dest"][::std::mem::size_of::<ib_uverbs_qp_dest>() - 32usize];
    ["Alignment of ib_uverbs_qp_dest"][::std::mem::align_of::<ib_uverbs_qp_dest>() - 4usize];
    ["Offset of field: ib_uverbs_qp_dest::dgid"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, dgid) - 0usize];
    ["Offset of field: ib_uverbs_qp_dest::flow_label"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, flow_label) - 16usize];
    ["Offset of field: ib_uverbs_qp_dest::dlid"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, dlid) - 20usize];
    ["Offset of field: ib_uverbs_qp_dest::reserved"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, reserved) - 22usize];
    ["Offset of field: ib_uverbs_qp_dest::sgid_index"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, sgid_index) - 24usize];
    ["Offset of field: ib_uverbs_qp_dest::hop_limit"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, hop_limit) - 25usize];
    ["Offset of field: ib_uverbs_qp_dest::traffic_class"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, traffic_class) - 26usize];
    ["Offset of field: ib_uverbs_qp_dest::sl"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, sl) - 27usize];
    ["Offset of field: ib_uverbs_qp_dest::src_path_bits"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, src_path_bits) - 28usize];
    ["Offset of field: ib_uverbs_qp_dest::static_rate"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, static_rate) - 29usize];
    ["Offset of field: ib_uverbs_qp_dest::is_global"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, is_global) - 30usize];
    ["Offset of field: ib_uverbs_qp_dest::port_num"]
        [::std::mem::offset_of!(ib_uverbs_qp_dest, port_num) - 31usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_qp {
    pub response: __u64,
    pub qp_handle: __u32,
    pub attr_mask: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_qp"][::std::mem::size_of::<ib_uverbs_query_qp>() - 16usize];
    ["Alignment of ib_uverbs_query_qp"][::std::mem::align_of::<ib_uverbs_query_qp>() - 8usize];
    ["Offset of field: ib_uverbs_query_qp::response"]
        [::std::mem::offset_of!(ib_uverbs_query_qp, response) - 0usize];
    ["Offset of field: ib_uverbs_query_qp::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_query_qp, qp_handle) - 8usize];
    ["Offset of field: ib_uverbs_query_qp::attr_mask"]
        [::std::mem::offset_of!(ib_uverbs_query_qp, attr_mask) - 12usize];
    ["Offset of field: ib_uverbs_query_qp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_query_qp, driver_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_qp_resp {
    pub dest: ib_uverbs_qp_dest,
    pub alt_dest: ib_uverbs_qp_dest,
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
    pub qkey: __u32,
    pub rq_psn: __u32,
    pub sq_psn: __u32,
    pub dest_qp_num: __u32,
    pub qp_access_flags: __u32,
    pub pkey_index: __u16,
    pub alt_pkey_index: __u16,
    pub qp_state: __u8,
    pub cur_qp_state: __u8,
    pub path_mtu: __u8,
    pub path_mig_state: __u8,
    pub sq_draining: __u8,
    pub max_rd_atomic: __u8,
    pub max_dest_rd_atomic: __u8,
    pub min_rnr_timer: __u8,
    pub port_num: __u8,
    pub timeout: __u8,
    pub retry_cnt: __u8,
    pub rnr_retry: __u8,
    pub alt_port_num: __u8,
    pub alt_timeout: __u8,
    pub sq_sig_all: __u8,
    pub reserved: [__u8; 5usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_qp_resp"]
        [::std::mem::size_of::<ib_uverbs_query_qp_resp>() - 128usize];
    ["Alignment of ib_uverbs_query_qp_resp"]
        [::std::mem::align_of::<ib_uverbs_query_qp_resp>() - 8usize];
    ["Offset of field: ib_uverbs_query_qp_resp::dest"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, dest) - 0usize];
    ["Offset of field: ib_uverbs_query_qp_resp::alt_dest"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, alt_dest) - 32usize];
    ["Offset of field: ib_uverbs_query_qp_resp::max_send_wr"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, max_send_wr) - 64usize];
    ["Offset of field: ib_uverbs_query_qp_resp::max_recv_wr"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, max_recv_wr) - 68usize];
    ["Offset of field: ib_uverbs_query_qp_resp::max_send_sge"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, max_send_sge) - 72usize];
    ["Offset of field: ib_uverbs_query_qp_resp::max_recv_sge"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, max_recv_sge) - 76usize];
    ["Offset of field: ib_uverbs_query_qp_resp::max_inline_data"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, max_inline_data) - 80usize];
    ["Offset of field: ib_uverbs_query_qp_resp::qkey"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, qkey) - 84usize];
    ["Offset of field: ib_uverbs_query_qp_resp::rq_psn"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, rq_psn) - 88usize];
    ["Offset of field: ib_uverbs_query_qp_resp::sq_psn"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, sq_psn) - 92usize];
    ["Offset of field: ib_uverbs_query_qp_resp::dest_qp_num"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, dest_qp_num) - 96usize];
    ["Offset of field: ib_uverbs_query_qp_resp::qp_access_flags"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, qp_access_flags) - 100usize];
    ["Offset of field: ib_uverbs_query_qp_resp::pkey_index"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, pkey_index) - 104usize];
    ["Offset of field: ib_uverbs_query_qp_resp::alt_pkey_index"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, alt_pkey_index) - 106usize];
    ["Offset of field: ib_uverbs_query_qp_resp::qp_state"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, qp_state) - 108usize];
    ["Offset of field: ib_uverbs_query_qp_resp::cur_qp_state"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, cur_qp_state) - 109usize];
    ["Offset of field: ib_uverbs_query_qp_resp::path_mtu"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, path_mtu) - 110usize];
    ["Offset of field: ib_uverbs_query_qp_resp::path_mig_state"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, path_mig_state) - 111usize];
    ["Offset of field: ib_uverbs_query_qp_resp::sq_draining"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, sq_draining) - 112usize];
    ["Offset of field: ib_uverbs_query_qp_resp::max_rd_atomic"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, max_rd_atomic) - 113usize];
    ["Offset of field: ib_uverbs_query_qp_resp::max_dest_rd_atomic"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, max_dest_rd_atomic) - 114usize];
    ["Offset of field: ib_uverbs_query_qp_resp::min_rnr_timer"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, min_rnr_timer) - 115usize];
    ["Offset of field: ib_uverbs_query_qp_resp::port_num"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, port_num) - 116usize];
    ["Offset of field: ib_uverbs_query_qp_resp::timeout"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, timeout) - 117usize];
    ["Offset of field: ib_uverbs_query_qp_resp::retry_cnt"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, retry_cnt) - 118usize];
    ["Offset of field: ib_uverbs_query_qp_resp::rnr_retry"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, rnr_retry) - 119usize];
    ["Offset of field: ib_uverbs_query_qp_resp::alt_port_num"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, alt_port_num) - 120usize];
    ["Offset of field: ib_uverbs_query_qp_resp::alt_timeout"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, alt_timeout) - 121usize];
    ["Offset of field: ib_uverbs_query_qp_resp::sq_sig_all"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, sq_sig_all) - 122usize];
    ["Offset of field: ib_uverbs_query_qp_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, reserved) - 123usize];
    ["Offset of field: ib_uverbs_query_qp_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_query_qp_resp, driver_data) - 128usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_modify_qp {
    pub dest: ib_uverbs_qp_dest,
    pub alt_dest: ib_uverbs_qp_dest,
    pub qp_handle: __u32,
    pub attr_mask: __u32,
    pub qkey: __u32,
    pub rq_psn: __u32,
    pub sq_psn: __u32,
    pub dest_qp_num: __u32,
    pub qp_access_flags: __u32,
    pub pkey_index: __u16,
    pub alt_pkey_index: __u16,
    pub qp_state: __u8,
    pub cur_qp_state: __u8,
    pub path_mtu: __u8,
    pub path_mig_state: __u8,
    pub en_sqd_async_notify: __u8,
    pub max_rd_atomic: __u8,
    pub max_dest_rd_atomic: __u8,
    pub min_rnr_timer: __u8,
    pub port_num: __u8,
    pub timeout: __u8,
    pub retry_cnt: __u8,
    pub rnr_retry: __u8,
    pub alt_port_num: __u8,
    pub alt_timeout: __u8,
    pub reserved: [__u8; 2usize],
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_modify_qp"][::std::mem::size_of::<ib_uverbs_modify_qp>() - 112usize];
    ["Alignment of ib_uverbs_modify_qp"][::std::mem::align_of::<ib_uverbs_modify_qp>() - 8usize];
    ["Offset of field: ib_uverbs_modify_qp::dest"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, dest) - 0usize];
    ["Offset of field: ib_uverbs_modify_qp::alt_dest"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, alt_dest) - 32usize];
    ["Offset of field: ib_uverbs_modify_qp::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, qp_handle) - 64usize];
    ["Offset of field: ib_uverbs_modify_qp::attr_mask"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, attr_mask) - 68usize];
    ["Offset of field: ib_uverbs_modify_qp::qkey"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, qkey) - 72usize];
    ["Offset of field: ib_uverbs_modify_qp::rq_psn"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, rq_psn) - 76usize];
    ["Offset of field: ib_uverbs_modify_qp::sq_psn"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, sq_psn) - 80usize];
    ["Offset of field: ib_uverbs_modify_qp::dest_qp_num"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, dest_qp_num) - 84usize];
    ["Offset of field: ib_uverbs_modify_qp::qp_access_flags"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, qp_access_flags) - 88usize];
    ["Offset of field: ib_uverbs_modify_qp::pkey_index"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, pkey_index) - 92usize];
    ["Offset of field: ib_uverbs_modify_qp::alt_pkey_index"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, alt_pkey_index) - 94usize];
    ["Offset of field: ib_uverbs_modify_qp::qp_state"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, qp_state) - 96usize];
    ["Offset of field: ib_uverbs_modify_qp::cur_qp_state"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, cur_qp_state) - 97usize];
    ["Offset of field: ib_uverbs_modify_qp::path_mtu"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, path_mtu) - 98usize];
    ["Offset of field: ib_uverbs_modify_qp::path_mig_state"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, path_mig_state) - 99usize];
    ["Offset of field: ib_uverbs_modify_qp::en_sqd_async_notify"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, en_sqd_async_notify) - 100usize];
    ["Offset of field: ib_uverbs_modify_qp::max_rd_atomic"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, max_rd_atomic) - 101usize];
    ["Offset of field: ib_uverbs_modify_qp::max_dest_rd_atomic"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, max_dest_rd_atomic) - 102usize];
    ["Offset of field: ib_uverbs_modify_qp::min_rnr_timer"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, min_rnr_timer) - 103usize];
    ["Offset of field: ib_uverbs_modify_qp::port_num"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, port_num) - 104usize];
    ["Offset of field: ib_uverbs_modify_qp::timeout"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, timeout) - 105usize];
    ["Offset of field: ib_uverbs_modify_qp::retry_cnt"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, retry_cnt) - 106usize];
    ["Offset of field: ib_uverbs_modify_qp::rnr_retry"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, rnr_retry) - 107usize];
    ["Offset of field: ib_uverbs_modify_qp::alt_port_num"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, alt_port_num) - 108usize];
    ["Offset of field: ib_uverbs_modify_qp::alt_timeout"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, alt_timeout) - 109usize];
    ["Offset of field: ib_uverbs_modify_qp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, reserved) - 110usize];
    ["Offset of field: ib_uverbs_modify_qp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_modify_qp, driver_data) - 112usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_ex_modify_qp {
    pub base: ib_uverbs_modify_qp,
    pub rate_limit: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_modify_qp"][::std::mem::size_of::<ib_uverbs_ex_modify_qp>() - 120usize];
    ["Alignment of ib_uverbs_ex_modify_qp"]
        [::std::mem::align_of::<ib_uverbs_ex_modify_qp>() - 8usize];
    ["Offset of field: ib_uverbs_ex_modify_qp::base"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_qp, base) - 0usize];
    ["Offset of field: ib_uverbs_ex_modify_qp::rate_limit"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_qp, rate_limit) - 112usize];
    ["Offset of field: ib_uverbs_ex_modify_qp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_qp, reserved) - 116usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_modify_qp_resp {
    pub comp_mask: __u32,
    pub response_length: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_modify_qp_resp"]
        [::std::mem::size_of::<ib_uverbs_ex_modify_qp_resp>() - 8usize];
    ["Alignment of ib_uverbs_ex_modify_qp_resp"]
        [::std::mem::align_of::<ib_uverbs_ex_modify_qp_resp>() - 4usize];
    ["Offset of field: ib_uverbs_ex_modify_qp_resp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_qp_resp, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_modify_qp_resp::response_length"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_qp_resp, response_length) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_qp {
    pub response: __u64,
    pub qp_handle: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_destroy_qp"][::std::mem::size_of::<ib_uverbs_destroy_qp>() - 16usize];
    ["Alignment of ib_uverbs_destroy_qp"][::std::mem::align_of::<ib_uverbs_destroy_qp>() - 8usize];
    ["Offset of field: ib_uverbs_destroy_qp::response"]
        [::std::mem::offset_of!(ib_uverbs_destroy_qp, response) - 0usize];
    ["Offset of field: ib_uverbs_destroy_qp::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_destroy_qp, qp_handle) - 8usize];
    ["Offset of field: ib_uverbs_destroy_qp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_destroy_qp, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_qp_resp {
    pub events_reported: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_destroy_qp_resp"]
        [::std::mem::size_of::<ib_uverbs_destroy_qp_resp>() - 4usize];
    ["Alignment of ib_uverbs_destroy_qp_resp"]
        [::std::mem::align_of::<ib_uverbs_destroy_qp_resp>() - 4usize];
    ["Offset of field: ib_uverbs_destroy_qp_resp::events_reported"]
        [::std::mem::offset_of!(ib_uverbs_destroy_qp_resp, events_reported) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_sge {
    pub addr: __u64,
    pub length: __u32,
    pub lkey: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_sge"][::std::mem::size_of::<ib_uverbs_sge>() - 16usize];
    ["Alignment of ib_uverbs_sge"][::std::mem::align_of::<ib_uverbs_sge>() - 8usize];
    ["Offset of field: ib_uverbs_sge::addr"][::std::mem::offset_of!(ib_uverbs_sge, addr) - 0usize];
    ["Offset of field: ib_uverbs_sge::length"]
        [::std::mem::offset_of!(ib_uverbs_sge, length) - 8usize];
    ["Offset of field: ib_uverbs_sge::lkey"][::std::mem::offset_of!(ib_uverbs_sge, lkey) - 12usize];
};
pub const IB_UVERBS_WR_RDMA_WRITE: ib_uverbs_wr_opcode = 0;
pub const IB_UVERBS_WR_RDMA_WRITE_WITH_IMM: ib_uverbs_wr_opcode = 1;
pub const IB_UVERBS_WR_SEND: ib_uverbs_wr_opcode = 2;
pub const IB_UVERBS_WR_SEND_WITH_IMM: ib_uverbs_wr_opcode = 3;
pub const IB_UVERBS_WR_RDMA_READ: ib_uverbs_wr_opcode = 4;
pub const IB_UVERBS_WR_ATOMIC_CMP_AND_SWP: ib_uverbs_wr_opcode = 5;
pub const IB_UVERBS_WR_ATOMIC_FETCH_AND_ADD: ib_uverbs_wr_opcode = 6;
pub const IB_UVERBS_WR_LOCAL_INV: ib_uverbs_wr_opcode = 7;
pub const IB_UVERBS_WR_BIND_MW: ib_uverbs_wr_opcode = 8;
pub const IB_UVERBS_WR_SEND_WITH_INV: ib_uverbs_wr_opcode = 9;
pub const IB_UVERBS_WR_TSO: ib_uverbs_wr_opcode = 10;
pub const IB_UVERBS_WR_RDMA_READ_WITH_INV: ib_uverbs_wr_opcode = 11;
pub const IB_UVERBS_WR_MASKED_ATOMIC_CMP_AND_SWP: ib_uverbs_wr_opcode = 12;
pub const IB_UVERBS_WR_MASKED_ATOMIC_FETCH_AND_ADD: ib_uverbs_wr_opcode = 13;
pub const IB_UVERBS_WR_FLUSH: ib_uverbs_wr_opcode = 14;
pub const IB_UVERBS_WR_ATOMIC_WRITE: ib_uverbs_wr_opcode = 15;
pub type ib_uverbs_wr_opcode = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ib_uverbs_send_wr {
    pub wr_id: __u64,
    pub num_sge: __u32,
    pub opcode: __u32,
    pub send_flags: __u32,
    pub ex: ib_uverbs_send_wr__bindgen_ty_1,
    pub wr: ib_uverbs_send_wr__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_send_wr__bindgen_ty_1 {
    pub imm_data: __be32,
    pub invalidate_rkey: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_send_wr__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_1>() - 4usize];
    ["Alignment of ib_uverbs_send_wr__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_1::imm_data"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_1, imm_data) - 0usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_1::invalidate_rkey"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_1, invalidate_rkey) - 0usize];
};
impl Default for ib_uverbs_send_wr__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_send_wr__bindgen_ty_2 {
    pub rdma: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1,
    pub atomic: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2,
    pub ud: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1 {
    pub remote_addr: __u64,
    pub rkey: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1>() - 16usize];
    ["Alignment of ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1::remote_addr"][::std::mem::offset_of!(
        ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1,
        remote_addr
    ) - 0usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1::rkey"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1, rkey) - 8usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1::reserved"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_1, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2 {
    pub remote_addr: __u64,
    pub compare_add: __u64,
    pub swap: __u64,
    pub rkey: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>() - 32usize];
    ["Alignment of ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2"]
        [::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2>() - 8usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2::remote_addr"][::std::mem::offset_of!(
        ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2,
        remote_addr
    ) - 0usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2::compare_add"][::std::mem::offset_of!(
        ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2,
        compare_add
    ) - 8usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2::swap"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2, swap) - 16usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2::rkey"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2, rkey) - 24usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2::reserved"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_2, reserved) - 28usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3 {
    pub ah: __u32,
    pub remote_qpn: __u32,
    pub remote_qkey: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3"]
        [::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3>() - 16usize];
    ["Alignment of ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3"]
        [::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3>() - 4usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3::ah"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3, ah) - 0usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3::remote_qpn"][::std::mem::offset_of!(
        ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3,
        remote_qpn
    ) - 4usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3::remote_qkey"][::std::mem::offset_of!(
        ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3,
        remote_qkey
    ) - 8usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3::reserved"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2__bindgen_ty_3, reserved) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_send_wr__bindgen_ty_2"]
        [::std::mem::size_of::<ib_uverbs_send_wr__bindgen_ty_2>() - 32usize];
    ["Alignment of ib_uverbs_send_wr__bindgen_ty_2"]
        [::std::mem::align_of::<ib_uverbs_send_wr__bindgen_ty_2>() - 8usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2::rdma"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2, rdma) - 0usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2::atomic"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2, atomic) - 0usize];
    ["Offset of field: ib_uverbs_send_wr__bindgen_ty_2::ud"]
        [::std::mem::offset_of!(ib_uverbs_send_wr__bindgen_ty_2, ud) - 0usize];
};
impl Default for ib_uverbs_send_wr__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_send_wr"][::std::mem::size_of::<ib_uverbs_send_wr>() - 56usize];
    ["Alignment of ib_uverbs_send_wr"][::std::mem::align_of::<ib_uverbs_send_wr>() - 8usize];
    ["Offset of field: ib_uverbs_send_wr::wr_id"]
        [::std::mem::offset_of!(ib_uverbs_send_wr, wr_id) - 0usize];
    ["Offset of field: ib_uverbs_send_wr::num_sge"]
        [::std::mem::offset_of!(ib_uverbs_send_wr, num_sge) - 8usize];
    ["Offset of field: ib_uverbs_send_wr::opcode"]
        [::std::mem::offset_of!(ib_uverbs_send_wr, opcode) - 12usize];
    ["Offset of field: ib_uverbs_send_wr::send_flags"]
        [::std::mem::offset_of!(ib_uverbs_send_wr, send_flags) - 16usize];
    ["Offset of field: ib_uverbs_send_wr::ex"]
        [::std::mem::offset_of!(ib_uverbs_send_wr, ex) - 20usize];
    ["Offset of field: ib_uverbs_send_wr::wr"]
        [::std::mem::offset_of!(ib_uverbs_send_wr, wr) - 24usize];
};
impl Default for ib_uverbs_send_wr {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct ib_uverbs_post_send {
    pub response: __u64,
    pub qp_handle: __u32,
    pub wr_count: __u32,
    pub sge_count: __u32,
    pub wqe_size: __u32,
    pub send_wr: __IncompleteArrayField<ib_uverbs_send_wr>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_post_send"][::std::mem::size_of::<ib_uverbs_post_send>() - 24usize];
    ["Alignment of ib_uverbs_post_send"][::std::mem::align_of::<ib_uverbs_post_send>() - 8usize];
    ["Offset of field: ib_uverbs_post_send::response"]
        [::std::mem::offset_of!(ib_uverbs_post_send, response) - 0usize];
    ["Offset of field: ib_uverbs_post_send::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_post_send, qp_handle) - 8usize];
    ["Offset of field: ib_uverbs_post_send::wr_count"]
        [::std::mem::offset_of!(ib_uverbs_post_send, wr_count) - 12usize];
    ["Offset of field: ib_uverbs_post_send::sge_count"]
        [::std::mem::offset_of!(ib_uverbs_post_send, sge_count) - 16usize];
    ["Offset of field: ib_uverbs_post_send::wqe_size"]
        [::std::mem::offset_of!(ib_uverbs_post_send, wqe_size) - 20usize];
    ["Offset of field: ib_uverbs_post_send::send_wr"]
        [::std::mem::offset_of!(ib_uverbs_post_send, send_wr) - 24usize];
};
impl Default for ib_uverbs_post_send {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_post_send_resp {
    pub bad_wr: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_post_send_resp"]
        [::std::mem::size_of::<ib_uverbs_post_send_resp>() - 4usize];
    ["Alignment of ib_uverbs_post_send_resp"]
        [::std::mem::align_of::<ib_uverbs_post_send_resp>() - 4usize];
    ["Offset of field: ib_uverbs_post_send_resp::bad_wr"]
        [::std::mem::offset_of!(ib_uverbs_post_send_resp, bad_wr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_recv_wr {
    pub wr_id: __u64,
    pub num_sge: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_recv_wr"][::std::mem::size_of::<ib_uverbs_recv_wr>() - 16usize];
    ["Alignment of ib_uverbs_recv_wr"][::std::mem::align_of::<ib_uverbs_recv_wr>() - 8usize];
    ["Offset of field: ib_uverbs_recv_wr::wr_id"]
        [::std::mem::offset_of!(ib_uverbs_recv_wr, wr_id) - 0usize];
    ["Offset of field: ib_uverbs_recv_wr::num_sge"]
        [::std::mem::offset_of!(ib_uverbs_recv_wr, num_sge) - 8usize];
    ["Offset of field: ib_uverbs_recv_wr::reserved"]
        [::std::mem::offset_of!(ib_uverbs_recv_wr, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_post_recv {
    pub response: __u64,
    pub qp_handle: __u32,
    pub wr_count: __u32,
    pub sge_count: __u32,
    pub wqe_size: __u32,
    pub recv_wr: __IncompleteArrayField<ib_uverbs_recv_wr>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_post_recv"][::std::mem::size_of::<ib_uverbs_post_recv>() - 24usize];
    ["Alignment of ib_uverbs_post_recv"][::std::mem::align_of::<ib_uverbs_post_recv>() - 8usize];
    ["Offset of field: ib_uverbs_post_recv::response"]
        [::std::mem::offset_of!(ib_uverbs_post_recv, response) - 0usize];
    ["Offset of field: ib_uverbs_post_recv::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_post_recv, qp_handle) - 8usize];
    ["Offset of field: ib_uverbs_post_recv::wr_count"]
        [::std::mem::offset_of!(ib_uverbs_post_recv, wr_count) - 12usize];
    ["Offset of field: ib_uverbs_post_recv::sge_count"]
        [::std::mem::offset_of!(ib_uverbs_post_recv, sge_count) - 16usize];
    ["Offset of field: ib_uverbs_post_recv::wqe_size"]
        [::std::mem::offset_of!(ib_uverbs_post_recv, wqe_size) - 20usize];
    ["Offset of field: ib_uverbs_post_recv::recv_wr"]
        [::std::mem::offset_of!(ib_uverbs_post_recv, recv_wr) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_post_recv_resp {
    pub bad_wr: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_post_recv_resp"]
        [::std::mem::size_of::<ib_uverbs_post_recv_resp>() - 4usize];
    ["Alignment of ib_uverbs_post_recv_resp"]
        [::std::mem::align_of::<ib_uverbs_post_recv_resp>() - 4usize];
    ["Offset of field: ib_uverbs_post_recv_resp::bad_wr"]
        [::std::mem::offset_of!(ib_uverbs_post_recv_resp, bad_wr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_post_srq_recv {
    pub response: __u64,
    pub srq_handle: __u32,
    pub wr_count: __u32,
    pub sge_count: __u32,
    pub wqe_size: __u32,
    pub recv: __IncompleteArrayField<ib_uverbs_recv_wr>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_post_srq_recv"][::std::mem::size_of::<ib_uverbs_post_srq_recv>() - 24usize];
    ["Alignment of ib_uverbs_post_srq_recv"]
        [::std::mem::align_of::<ib_uverbs_post_srq_recv>() - 8usize];
    ["Offset of field: ib_uverbs_post_srq_recv::response"]
        [::std::mem::offset_of!(ib_uverbs_post_srq_recv, response) - 0usize];
    ["Offset of field: ib_uverbs_post_srq_recv::srq_handle"]
        [::std::mem::offset_of!(ib_uverbs_post_srq_recv, srq_handle) - 8usize];
    ["Offset of field: ib_uverbs_post_srq_recv::wr_count"]
        [::std::mem::offset_of!(ib_uverbs_post_srq_recv, wr_count) - 12usize];
    ["Offset of field: ib_uverbs_post_srq_recv::sge_count"]
        [::std::mem::offset_of!(ib_uverbs_post_srq_recv, sge_count) - 16usize];
    ["Offset of field: ib_uverbs_post_srq_recv::wqe_size"]
        [::std::mem::offset_of!(ib_uverbs_post_srq_recv, wqe_size) - 20usize];
    ["Offset of field: ib_uverbs_post_srq_recv::recv"]
        [::std::mem::offset_of!(ib_uverbs_post_srq_recv, recv) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_post_srq_recv_resp {
    pub bad_wr: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_post_srq_recv_resp"]
        [::std::mem::size_of::<ib_uverbs_post_srq_recv_resp>() - 4usize];
    ["Alignment of ib_uverbs_post_srq_recv_resp"]
        [::std::mem::align_of::<ib_uverbs_post_srq_recv_resp>() - 4usize];
    ["Offset of field: ib_uverbs_post_srq_recv_resp::bad_wr"]
        [::std::mem::offset_of!(ib_uverbs_post_srq_recv_resp, bad_wr) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_ah {
    pub response: __u64,
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub reserved: __u32,
    pub attr: ib_uverbs_ah_attr,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_ah"][::std::mem::size_of::<ib_uverbs_create_ah>() - 56usize];
    ["Alignment of ib_uverbs_create_ah"][::std::mem::align_of::<ib_uverbs_create_ah>() - 8usize];
    ["Offset of field: ib_uverbs_create_ah::response"]
        [::std::mem::offset_of!(ib_uverbs_create_ah, response) - 0usize];
    ["Offset of field: ib_uverbs_create_ah::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_ah, user_handle) - 8usize];
    ["Offset of field: ib_uverbs_create_ah::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_ah, pd_handle) - 16usize];
    ["Offset of field: ib_uverbs_create_ah::reserved"]
        [::std::mem::offset_of!(ib_uverbs_create_ah, reserved) - 20usize];
    ["Offset of field: ib_uverbs_create_ah::attr"]
        [::std::mem::offset_of!(ib_uverbs_create_ah, attr) - 24usize];
    ["Offset of field: ib_uverbs_create_ah::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_ah, driver_data) - 56usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_ah_resp {
    pub ah_handle: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_ah_resp"]
        [::std::mem::size_of::<ib_uverbs_create_ah_resp>() - 4usize];
    ["Alignment of ib_uverbs_create_ah_resp"]
        [::std::mem::align_of::<ib_uverbs_create_ah_resp>() - 4usize];
    ["Offset of field: ib_uverbs_create_ah_resp::ah_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_ah_resp, ah_handle) - 0usize];
    ["Offset of field: ib_uverbs_create_ah_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_ah_resp, driver_data) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_ah {
    pub ah_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_destroy_ah"][::std::mem::size_of::<ib_uverbs_destroy_ah>() - 4usize];
    ["Alignment of ib_uverbs_destroy_ah"][::std::mem::align_of::<ib_uverbs_destroy_ah>() - 4usize];
    ["Offset of field: ib_uverbs_destroy_ah::ah_handle"]
        [::std::mem::offset_of!(ib_uverbs_destroy_ah, ah_handle) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_attach_mcast {
    pub gid: [__u8; 16usize],
    pub qp_handle: __u32,
    pub mlid: __u16,
    pub reserved: __u16,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_attach_mcast"][::std::mem::size_of::<ib_uverbs_attach_mcast>() - 24usize];
    ["Alignment of ib_uverbs_attach_mcast"]
        [::std::mem::align_of::<ib_uverbs_attach_mcast>() - 8usize];
    ["Offset of field: ib_uverbs_attach_mcast::gid"]
        [::std::mem::offset_of!(ib_uverbs_attach_mcast, gid) - 0usize];
    ["Offset of field: ib_uverbs_attach_mcast::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_attach_mcast, qp_handle) - 16usize];
    ["Offset of field: ib_uverbs_attach_mcast::mlid"]
        [::std::mem::offset_of!(ib_uverbs_attach_mcast, mlid) - 20usize];
    ["Offset of field: ib_uverbs_attach_mcast::reserved"]
        [::std::mem::offset_of!(ib_uverbs_attach_mcast, reserved) - 22usize];
    ["Offset of field: ib_uverbs_attach_mcast::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_attach_mcast, driver_data) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_detach_mcast {
    pub gid: [__u8; 16usize],
    pub qp_handle: __u32,
    pub mlid: __u16,
    pub reserved: __u16,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_detach_mcast"][::std::mem::size_of::<ib_uverbs_detach_mcast>() - 24usize];
    ["Alignment of ib_uverbs_detach_mcast"]
        [::std::mem::align_of::<ib_uverbs_detach_mcast>() - 8usize];
    ["Offset of field: ib_uverbs_detach_mcast::gid"]
        [::std::mem::offset_of!(ib_uverbs_detach_mcast, gid) - 0usize];
    ["Offset of field: ib_uverbs_detach_mcast::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_detach_mcast, qp_handle) - 16usize];
    ["Offset of field: ib_uverbs_detach_mcast::mlid"]
        [::std::mem::offset_of!(ib_uverbs_detach_mcast, mlid) - 20usize];
    ["Offset of field: ib_uverbs_detach_mcast::reserved"]
        [::std::mem::offset_of!(ib_uverbs_detach_mcast, reserved) - 22usize];
    ["Offset of field: ib_uverbs_detach_mcast::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_detach_mcast, driver_data) - 24usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_flow_spec_hdr {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
    pub flow_spec_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_hdr"][::std::mem::size_of::<ib_uverbs_flow_spec_hdr>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_hdr"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_hdr>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_hdr::type_"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_hdr, type_) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_hdr::size"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_hdr, size) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_hdr::reserved"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_hdr, reserved) - 6usize];
    ["Offset of field: ib_uverbs_flow_spec_hdr::flow_spec_data"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_hdr, flow_spec_data) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_eth_filter {
    pub dst_mac: [__u8; 6usize],
    pub src_mac: [__u8; 6usize],
    pub ether_type: __be16,
    pub vlan_tag: __be16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_eth_filter"]
        [::std::mem::size_of::<ib_uverbs_flow_eth_filter>() - 16usize];
    ["Alignment of ib_uverbs_flow_eth_filter"]
        [::std::mem::align_of::<ib_uverbs_flow_eth_filter>() - 2usize];
    ["Offset of field: ib_uverbs_flow_eth_filter::dst_mac"]
        [::std::mem::offset_of!(ib_uverbs_flow_eth_filter, dst_mac) - 0usize];
    ["Offset of field: ib_uverbs_flow_eth_filter::src_mac"]
        [::std::mem::offset_of!(ib_uverbs_flow_eth_filter, src_mac) - 6usize];
    ["Offset of field: ib_uverbs_flow_eth_filter::ether_type"]
        [::std::mem::offset_of!(ib_uverbs_flow_eth_filter, ether_type) - 12usize];
    ["Offset of field: ib_uverbs_flow_eth_filter::vlan_tag"]
        [::std::mem::offset_of!(ib_uverbs_flow_eth_filter, vlan_tag) - 14usize];
};
#[repr(C)]
pub struct ib_uverbs_flow_spec_eth {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_eth__bindgen_ty_1,
    pub val: ib_uverbs_flow_eth_filter,
    pub mask: ib_uverbs_flow_eth_filter,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_eth__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1: __BindgenUnionField<ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1,
        type_
    ) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1,
        size
    ) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_eth__bindgen_ty_1__bindgen_ty_1,
        reserved
    ) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_eth__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_eth__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_eth__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_eth__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_eth__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_eth__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_eth__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_eth"][::std::mem::size_of::<ib_uverbs_flow_spec_eth>() - 40usize];
    ["Alignment of ib_uverbs_flow_spec_eth"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_eth>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_eth::val"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_eth, val) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_eth::mask"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_eth, mask) - 24usize];
};
impl Default for ib_uverbs_flow_spec_eth {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_ipv4_filter {
    pub src_ip: __be32,
    pub dst_ip: __be32,
    pub proto: __u8,
    pub tos: __u8,
    pub ttl: __u8,
    pub flags: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_ipv4_filter"]
        [::std::mem::size_of::<ib_uverbs_flow_ipv4_filter>() - 12usize];
    ["Alignment of ib_uverbs_flow_ipv4_filter"]
        [::std::mem::align_of::<ib_uverbs_flow_ipv4_filter>() - 4usize];
    ["Offset of field: ib_uverbs_flow_ipv4_filter::src_ip"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv4_filter, src_ip) - 0usize];
    ["Offset of field: ib_uverbs_flow_ipv4_filter::dst_ip"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv4_filter, dst_ip) - 4usize];
    ["Offset of field: ib_uverbs_flow_ipv4_filter::proto"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv4_filter, proto) - 8usize];
    ["Offset of field: ib_uverbs_flow_ipv4_filter::tos"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv4_filter, tos) - 9usize];
    ["Offset of field: ib_uverbs_flow_ipv4_filter::ttl"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv4_filter, ttl) - 10usize];
    ["Offset of field: ib_uverbs_flow_ipv4_filter::flags"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv4_filter, flags) - 11usize];
};
#[repr(C)]
pub struct ib_uverbs_flow_spec_ipv4 {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_ipv4__bindgen_ty_1,
    pub val: ib_uverbs_flow_ipv4_filter,
    pub mask: ib_uverbs_flow_ipv4_filter,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_ipv4__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1: __BindgenUnionField<ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1,
        type_
    ) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1,
        size
    ) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_ipv4__bindgen_ty_1__bindgen_ty_1,
        reserved
    ) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_ipv4__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_ipv4__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_ipv4__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_ipv4__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv4__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_ipv4__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_ipv4__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_ipv4"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_ipv4>() - 32usize];
    ["Alignment of ib_uverbs_flow_spec_ipv4"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_ipv4>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv4::val"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_ipv4, val) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv4::mask"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_ipv4, mask) - 20usize];
};
impl Default for ib_uverbs_flow_spec_ipv4 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_tcp_udp_filter {
    pub dst_port: __be16,
    pub src_port: __be16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_tcp_udp_filter"]
        [::std::mem::size_of::<ib_uverbs_flow_tcp_udp_filter>() - 4usize];
    ["Alignment of ib_uverbs_flow_tcp_udp_filter"]
        [::std::mem::align_of::<ib_uverbs_flow_tcp_udp_filter>() - 2usize];
    ["Offset of field: ib_uverbs_flow_tcp_udp_filter::dst_port"]
        [::std::mem::offset_of!(ib_uverbs_flow_tcp_udp_filter, dst_port) - 0usize];
    ["Offset of field: ib_uverbs_flow_tcp_udp_filter::src_port"]
        [::std::mem::offset_of!(ib_uverbs_flow_tcp_udp_filter, src_port) - 2usize];
};
#[repr(C)]
pub struct ib_uverbs_flow_spec_tcp_udp {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1,
    pub val: ib_uverbs_flow_tcp_udp_filter,
    pub mask: ib_uverbs_flow_tcp_udp_filter,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1:
        __BindgenUnionField<ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1,
        type_
    ) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1,
        size
    ) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1__bindgen_ty_1,
        reserved
    )
        - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_tcp_udp__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_tcp_udp"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_tcp_udp>() - 16usize];
    ["Alignment of ib_uverbs_flow_spec_tcp_udp"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_tcp_udp>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_tcp_udp::val"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_tcp_udp, val) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_tcp_udp::mask"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_tcp_udp, mask) - 12usize];
};
impl Default for ib_uverbs_flow_spec_tcp_udp {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_ipv6_filter {
    pub src_ip: [__u8; 16usize],
    pub dst_ip: [__u8; 16usize],
    pub flow_label: __be32,
    pub next_hdr: __u8,
    pub traffic_class: __u8,
    pub hop_limit: __u8,
    pub reserved: __u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_ipv6_filter"]
        [::std::mem::size_of::<ib_uverbs_flow_ipv6_filter>() - 40usize];
    ["Alignment of ib_uverbs_flow_ipv6_filter"]
        [::std::mem::align_of::<ib_uverbs_flow_ipv6_filter>() - 4usize];
    ["Offset of field: ib_uverbs_flow_ipv6_filter::src_ip"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv6_filter, src_ip) - 0usize];
    ["Offset of field: ib_uverbs_flow_ipv6_filter::dst_ip"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv6_filter, dst_ip) - 16usize];
    ["Offset of field: ib_uverbs_flow_ipv6_filter::flow_label"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv6_filter, flow_label) - 32usize];
    ["Offset of field: ib_uverbs_flow_ipv6_filter::next_hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv6_filter, next_hdr) - 36usize];
    ["Offset of field: ib_uverbs_flow_ipv6_filter::traffic_class"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv6_filter, traffic_class) - 37usize];
    ["Offset of field: ib_uverbs_flow_ipv6_filter::hop_limit"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv6_filter, hop_limit) - 38usize];
    ["Offset of field: ib_uverbs_flow_ipv6_filter::reserved"]
        [::std::mem::offset_of!(ib_uverbs_flow_ipv6_filter, reserved) - 39usize];
};
#[repr(C)]
pub struct ib_uverbs_flow_spec_ipv6 {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_ipv6__bindgen_ty_1,
    pub val: ib_uverbs_flow_ipv6_filter,
    pub mask: ib_uverbs_flow_ipv6_filter,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_ipv6__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1: __BindgenUnionField<ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1,
        type_
    ) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1,
        size
    ) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_ipv6__bindgen_ty_1__bindgen_ty_1,
        reserved
    ) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_ipv6__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_ipv6__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_ipv6__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_ipv6__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv6__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_ipv6__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_ipv6__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_ipv6"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_ipv6>() - 88usize];
    ["Alignment of ib_uverbs_flow_spec_ipv6"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_ipv6>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv6::val"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_ipv6, val) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_ipv6::mask"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_ipv6, mask) - 48usize];
};
impl Default for ib_uverbs_flow_spec_ipv6 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_action_tag {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_action_tag__bindgen_ty_1,
    pub tag_id: __u32,
    pub reserved1: __u32,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_action_tag__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1:
        __BindgenUnionField<ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1,
    >() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1,
        type_
    )
        - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1,
        size
    )
        - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_tag__bindgen_ty_1__bindgen_ty_1,
        reserved
    )
        - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_tag__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_action_tag__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_tag__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_tag__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_tag__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_tag__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_action_tag__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_tag"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_action_tag>() - 16usize];
    ["Alignment of ib_uverbs_flow_spec_action_tag"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_tag>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_tag::tag_id"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_tag, tag_id) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_tag::reserved1"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_tag, reserved1) - 12usize];
};
impl Default for ib_uverbs_flow_spec_action_tag {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_action_drop {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_action_drop__bindgen_ty_1,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_action_drop__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1:
        __BindgenUnionField<ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1>()
            - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1,
        type_
    )
        - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1,
        size
    )
        - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_drop__bindgen_ty_1__bindgen_ty_1,
        reserved
    )
        - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_drop__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_action_drop__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_drop__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_drop__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_drop__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_drop__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_action_drop__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_drop"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_action_drop>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_drop"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_drop>() - 8usize];
};
impl Default for ib_uverbs_flow_spec_action_drop {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_action_handle {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_action_handle__bindgen_ty_1,
    pub handle: __u32,
    pub reserved1: __u32,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_action_handle__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1:
        __BindgenUnionField<ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1>()
            - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1,
        type_
    )
        - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1,
        size
    )
        - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_handle__bindgen_ty_1__bindgen_ty_1,
        reserved
    )
        - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_handle__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_action_handle__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_handle__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_handle__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_handle__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_handle__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_action_handle__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_handle"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_action_handle>() - 16usize];
    ["Alignment of ib_uverbs_flow_spec_action_handle"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_handle>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_handle::handle"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_handle, handle) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_handle::reserved1"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_handle, reserved1) - 12usize];
};
impl Default for ib_uverbs_flow_spec_action_handle {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_action_count {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_action_count__bindgen_ty_1,
    pub handle: __u32,
    pub reserved1: __u32,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_action_count__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1:
        __BindgenUnionField<ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1>()
            - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1,
        type_
    )
        - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1,
        size
    )
        - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_action_count__bindgen_ty_1__bindgen_ty_1,
        reserved
    )
        - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_count__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_action_count__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_action_count__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_count__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_count__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_count__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_action_count__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_action_count"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_action_count>() - 16usize];
    ["Alignment of ib_uverbs_flow_spec_action_count"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_action_count>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_count::handle"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_count, handle) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_action_count::reserved1"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_action_count, reserved1) - 12usize];
};
impl Default for ib_uverbs_flow_spec_action_count {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_tunnel_filter {
    pub tunnel_id: __be32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_tunnel_filter"]
        [::std::mem::size_of::<ib_uverbs_flow_tunnel_filter>() - 4usize];
    ["Alignment of ib_uverbs_flow_tunnel_filter"]
        [::std::mem::align_of::<ib_uverbs_flow_tunnel_filter>() - 4usize];
    ["Offset of field: ib_uverbs_flow_tunnel_filter::tunnel_id"]
        [::std::mem::offset_of!(ib_uverbs_flow_tunnel_filter, tunnel_id) - 0usize];
};
#[repr(C)]
pub struct ib_uverbs_flow_spec_tunnel {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_tunnel__bindgen_ty_1,
    pub val: ib_uverbs_flow_tunnel_filter,
    pub mask: ib_uverbs_flow_tunnel_filter,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_tunnel__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1:
        __BindgenUnionField<ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1,
        type_
    ) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1,
        size
    ) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_tunnel__bindgen_ty_1__bindgen_ty_1,
        reserved
    )
        - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_tunnel__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_tunnel__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_tunnel__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_tunnel__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_tunnel__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_tunnel__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_tunnel__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_tunnel"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_tunnel>() - 16usize];
    ["Alignment of ib_uverbs_flow_spec_tunnel"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_tunnel>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_tunnel::val"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_tunnel, val) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_tunnel::mask"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_tunnel, mask) - 12usize];
};
impl Default for ib_uverbs_flow_spec_tunnel {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_esp_filter {
    pub spi: __u32,
    pub seq: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_esp_filter"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_esp_filter>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_esp_filter"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_esp_filter>() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_esp_filter::spi"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_esp_filter, spi) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_esp_filter::seq"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_esp_filter, seq) - 4usize];
};
#[repr(C)]
pub struct ib_uverbs_flow_spec_esp {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_esp__bindgen_ty_1,
    pub val: ib_uverbs_flow_spec_esp_filter,
    pub mask: ib_uverbs_flow_spec_esp_filter,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_esp__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1: __BindgenUnionField<ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1,
        type_
    ) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1,
        size
    ) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_esp__bindgen_ty_1__bindgen_ty_1,
        reserved
    ) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_esp__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_esp__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_esp__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_esp__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_esp__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_esp__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_esp__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_esp"][::std::mem::size_of::<ib_uverbs_flow_spec_esp>() - 24usize];
    ["Alignment of ib_uverbs_flow_spec_esp"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_esp>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_esp::val"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_esp, val) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_esp::mask"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_esp, mask) - 16usize];
};
impl Default for ib_uverbs_flow_spec_esp {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_gre_filter {
    pub c_ks_res0_ver: __be16,
    pub protocol: __be16,
    pub key: __be32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_gre_filter"]
        [::std::mem::size_of::<ib_uverbs_flow_gre_filter>() - 8usize];
    ["Alignment of ib_uverbs_flow_gre_filter"]
        [::std::mem::align_of::<ib_uverbs_flow_gre_filter>() - 4usize];
    ["Offset of field: ib_uverbs_flow_gre_filter::c_ks_res0_ver"]
        [::std::mem::offset_of!(ib_uverbs_flow_gre_filter, c_ks_res0_ver) - 0usize];
    ["Offset of field: ib_uverbs_flow_gre_filter::protocol"]
        [::std::mem::offset_of!(ib_uverbs_flow_gre_filter, protocol) - 2usize];
    ["Offset of field: ib_uverbs_flow_gre_filter::key"]
        [::std::mem::offset_of!(ib_uverbs_flow_gre_filter, key) - 4usize];
};
#[repr(C)]
pub struct ib_uverbs_flow_spec_gre {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_gre__bindgen_ty_1,
    pub val: ib_uverbs_flow_gre_filter,
    pub mask: ib_uverbs_flow_gre_filter,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_gre__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1: __BindgenUnionField<ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1,
        type_
    ) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1,
        size
    ) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_gre__bindgen_ty_1__bindgen_ty_1,
        reserved
    ) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_gre__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_gre__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_gre__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_gre__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_gre__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_gre__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_gre__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_gre"][::std::mem::size_of::<ib_uverbs_flow_spec_gre>() - 24usize];
    ["Alignment of ib_uverbs_flow_spec_gre"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_gre>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_gre::val"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_gre, val) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_gre::mask"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_gre, mask) - 16usize];
};
impl Default for ib_uverbs_flow_spec_gre {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_mpls_filter {
    pub label: __be32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_mpls_filter"]
        [::std::mem::size_of::<ib_uverbs_flow_mpls_filter>() - 4usize];
    ["Alignment of ib_uverbs_flow_mpls_filter"]
        [::std::mem::align_of::<ib_uverbs_flow_mpls_filter>() - 4usize];
    ["Offset of field: ib_uverbs_flow_mpls_filter::label"]
        [::std::mem::offset_of!(ib_uverbs_flow_mpls_filter, label) - 0usize];
};
#[repr(C)]
pub struct ib_uverbs_flow_spec_mpls {
    pub __bindgen_anon_1: ib_uverbs_flow_spec_mpls__bindgen_ty_1,
    pub val: ib_uverbs_flow_mpls_filter,
    pub mask: ib_uverbs_flow_mpls_filter,
}
#[repr(C)]
pub struct ib_uverbs_flow_spec_mpls__bindgen_ty_1 {
    pub hdr: __BindgenUnionField<ib_uverbs_flow_spec_hdr>,
    pub __bindgen_anon_1: __BindgenUnionField<ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1 {
    pub type_: __u32,
    pub size: __u16,
    pub reserved: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1::type_"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1,
        type_
    ) - 0usize];
    ["Offset of field: ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1::size"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1,
        size
    ) - 4usize];
    ["Offset of field: ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1::reserved"][::std::mem::offset_of!(
        ib_uverbs_flow_spec_mpls__bindgen_ty_1__bindgen_ty_1,
        reserved
    ) - 6usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_mpls__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_mpls__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_spec_mpls__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_mpls__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_mpls__bindgen_ty_1::hdr"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_mpls__bindgen_ty_1, hdr) - 0usize];
};
impl Default for ib_uverbs_flow_spec_mpls__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_spec_mpls"]
        [::std::mem::size_of::<ib_uverbs_flow_spec_mpls>() - 16usize];
    ["Alignment of ib_uverbs_flow_spec_mpls"]
        [::std::mem::align_of::<ib_uverbs_flow_spec_mpls>() - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_mpls::val"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_mpls, val) - 8usize];
    ["Offset of field: ib_uverbs_flow_spec_mpls::mask"]
        [::std::mem::offset_of!(ib_uverbs_flow_spec_mpls, mask) - 12usize];
};
impl Default for ib_uverbs_flow_spec_mpls {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_flow_attr {
    pub type_: __u32,
    pub size: __u16,
    pub priority: __u16,
    pub num_of_specs: __u8,
    pub reserved: [__u8; 2usize],
    pub port: __u8,
    pub flags: __u32,
    pub flow_specs: __IncompleteArrayField<ib_uverbs_flow_spec_hdr>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_attr"][::std::mem::size_of::<ib_uverbs_flow_attr>() - 16usize];
    ["Alignment of ib_uverbs_flow_attr"][::std::mem::align_of::<ib_uverbs_flow_attr>() - 8usize];
    ["Offset of field: ib_uverbs_flow_attr::type_"]
        [::std::mem::offset_of!(ib_uverbs_flow_attr, type_) - 0usize];
    ["Offset of field: ib_uverbs_flow_attr::size"]
        [::std::mem::offset_of!(ib_uverbs_flow_attr, size) - 4usize];
    ["Offset of field: ib_uverbs_flow_attr::priority"]
        [::std::mem::offset_of!(ib_uverbs_flow_attr, priority) - 6usize];
    ["Offset of field: ib_uverbs_flow_attr::num_of_specs"]
        [::std::mem::offset_of!(ib_uverbs_flow_attr, num_of_specs) - 8usize];
    ["Offset of field: ib_uverbs_flow_attr::reserved"]
        [::std::mem::offset_of!(ib_uverbs_flow_attr, reserved) - 9usize];
    ["Offset of field: ib_uverbs_flow_attr::port"]
        [::std::mem::offset_of!(ib_uverbs_flow_attr, port) - 11usize];
    ["Offset of field: ib_uverbs_flow_attr::flags"]
        [::std::mem::offset_of!(ib_uverbs_flow_attr, flags) - 12usize];
    ["Offset of field: ib_uverbs_flow_attr::flow_specs"]
        [::std::mem::offset_of!(ib_uverbs_flow_attr, flow_specs) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_flow {
    pub comp_mask: __u32,
    pub qp_handle: __u32,
    pub flow_attr: ib_uverbs_flow_attr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_flow"][::std::mem::size_of::<ib_uverbs_create_flow>() - 24usize];
    ["Alignment of ib_uverbs_create_flow"]
        [::std::mem::align_of::<ib_uverbs_create_flow>() - 8usize];
    ["Offset of field: ib_uverbs_create_flow::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_create_flow, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_create_flow::qp_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_flow, qp_handle) - 4usize];
    ["Offset of field: ib_uverbs_create_flow::flow_attr"]
        [::std::mem::offset_of!(ib_uverbs_create_flow, flow_attr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_create_flow_resp {
    pub comp_mask: __u32,
    pub flow_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_flow_resp"]
        [::std::mem::size_of::<ib_uverbs_create_flow_resp>() - 8usize];
    ["Alignment of ib_uverbs_create_flow_resp"]
        [::std::mem::align_of::<ib_uverbs_create_flow_resp>() - 4usize];
    ["Offset of field: ib_uverbs_create_flow_resp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_create_flow_resp, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_create_flow_resp::flow_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_flow_resp, flow_handle) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_flow {
    pub comp_mask: __u32,
    pub flow_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_destroy_flow"][::std::mem::size_of::<ib_uverbs_destroy_flow>() - 8usize];
    ["Alignment of ib_uverbs_destroy_flow"]
        [::std::mem::align_of::<ib_uverbs_destroy_flow>() - 4usize];
    ["Offset of field: ib_uverbs_destroy_flow::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_destroy_flow, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_destroy_flow::flow_handle"]
        [::std::mem::offset_of!(ib_uverbs_destroy_flow, flow_handle) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_srq {
    pub response: __u64,
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub max_wr: __u32,
    pub max_sge: __u32,
    pub srq_limit: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_srq"][::std::mem::size_of::<ib_uverbs_create_srq>() - 32usize];
    ["Alignment of ib_uverbs_create_srq"][::std::mem::align_of::<ib_uverbs_create_srq>() - 8usize];
    ["Offset of field: ib_uverbs_create_srq::response"]
        [::std::mem::offset_of!(ib_uverbs_create_srq, response) - 0usize];
    ["Offset of field: ib_uverbs_create_srq::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_srq, user_handle) - 8usize];
    ["Offset of field: ib_uverbs_create_srq::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_srq, pd_handle) - 16usize];
    ["Offset of field: ib_uverbs_create_srq::max_wr"]
        [::std::mem::offset_of!(ib_uverbs_create_srq, max_wr) - 20usize];
    ["Offset of field: ib_uverbs_create_srq::max_sge"]
        [::std::mem::offset_of!(ib_uverbs_create_srq, max_sge) - 24usize];
    ["Offset of field: ib_uverbs_create_srq::srq_limit"]
        [::std::mem::offset_of!(ib_uverbs_create_srq, srq_limit) - 28usize];
    ["Offset of field: ib_uverbs_create_srq::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_srq, driver_data) - 32usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_xsrq {
    pub response: __u64,
    pub user_handle: __u64,
    pub srq_type: __u32,
    pub pd_handle: __u32,
    pub max_wr: __u32,
    pub max_sge: __u32,
    pub srq_limit: __u32,
    pub max_num_tags: __u32,
    pub xrcd_handle: __u32,
    pub cq_handle: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_xsrq"][::std::mem::size_of::<ib_uverbs_create_xsrq>() - 48usize];
    ["Alignment of ib_uverbs_create_xsrq"]
        [::std::mem::align_of::<ib_uverbs_create_xsrq>() - 8usize];
    ["Offset of field: ib_uverbs_create_xsrq::response"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, response) - 0usize];
    ["Offset of field: ib_uverbs_create_xsrq::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, user_handle) - 8usize];
    ["Offset of field: ib_uverbs_create_xsrq::srq_type"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, srq_type) - 16usize];
    ["Offset of field: ib_uverbs_create_xsrq::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, pd_handle) - 20usize];
    ["Offset of field: ib_uverbs_create_xsrq::max_wr"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, max_wr) - 24usize];
    ["Offset of field: ib_uverbs_create_xsrq::max_sge"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, max_sge) - 28usize];
    ["Offset of field: ib_uverbs_create_xsrq::srq_limit"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, srq_limit) - 32usize];
    ["Offset of field: ib_uverbs_create_xsrq::max_num_tags"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, max_num_tags) - 36usize];
    ["Offset of field: ib_uverbs_create_xsrq::xrcd_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, xrcd_handle) - 40usize];
    ["Offset of field: ib_uverbs_create_xsrq::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, cq_handle) - 44usize];
    ["Offset of field: ib_uverbs_create_xsrq::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_xsrq, driver_data) - 48usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_create_srq_resp {
    pub srq_handle: __u32,
    pub max_wr: __u32,
    pub max_sge: __u32,
    pub srqn: __u32,
    pub driver_data: __IncompleteArrayField<__u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_create_srq_resp"]
        [::std::mem::size_of::<ib_uverbs_create_srq_resp>() - 16usize];
    ["Alignment of ib_uverbs_create_srq_resp"]
        [::std::mem::align_of::<ib_uverbs_create_srq_resp>() - 4usize];
    ["Offset of field: ib_uverbs_create_srq_resp::srq_handle"]
        [::std::mem::offset_of!(ib_uverbs_create_srq_resp, srq_handle) - 0usize];
    ["Offset of field: ib_uverbs_create_srq_resp::max_wr"]
        [::std::mem::offset_of!(ib_uverbs_create_srq_resp, max_wr) - 4usize];
    ["Offset of field: ib_uverbs_create_srq_resp::max_sge"]
        [::std::mem::offset_of!(ib_uverbs_create_srq_resp, max_sge) - 8usize];
    ["Offset of field: ib_uverbs_create_srq_resp::srqn"]
        [::std::mem::offset_of!(ib_uverbs_create_srq_resp, srqn) - 12usize];
    ["Offset of field: ib_uverbs_create_srq_resp::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_create_srq_resp, driver_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_modify_srq {
    pub srq_handle: __u32,
    pub attr_mask: __u32,
    pub max_wr: __u32,
    pub srq_limit: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_modify_srq"][::std::mem::size_of::<ib_uverbs_modify_srq>() - 16usize];
    ["Alignment of ib_uverbs_modify_srq"][::std::mem::align_of::<ib_uverbs_modify_srq>() - 8usize];
    ["Offset of field: ib_uverbs_modify_srq::srq_handle"]
        [::std::mem::offset_of!(ib_uverbs_modify_srq, srq_handle) - 0usize];
    ["Offset of field: ib_uverbs_modify_srq::attr_mask"]
        [::std::mem::offset_of!(ib_uverbs_modify_srq, attr_mask) - 4usize];
    ["Offset of field: ib_uverbs_modify_srq::max_wr"]
        [::std::mem::offset_of!(ib_uverbs_modify_srq, max_wr) - 8usize];
    ["Offset of field: ib_uverbs_modify_srq::srq_limit"]
        [::std::mem::offset_of!(ib_uverbs_modify_srq, srq_limit) - 12usize];
    ["Offset of field: ib_uverbs_modify_srq::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_modify_srq, driver_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_query_srq {
    pub response: __u64,
    pub srq_handle: __u32,
    pub reserved: __u32,
    pub driver_data: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_srq"][::std::mem::size_of::<ib_uverbs_query_srq>() - 16usize];
    ["Alignment of ib_uverbs_query_srq"][::std::mem::align_of::<ib_uverbs_query_srq>() - 8usize];
    ["Offset of field: ib_uverbs_query_srq::response"]
        [::std::mem::offset_of!(ib_uverbs_query_srq, response) - 0usize];
    ["Offset of field: ib_uverbs_query_srq::srq_handle"]
        [::std::mem::offset_of!(ib_uverbs_query_srq, srq_handle) - 8usize];
    ["Offset of field: ib_uverbs_query_srq::reserved"]
        [::std::mem::offset_of!(ib_uverbs_query_srq, reserved) - 12usize];
    ["Offset of field: ib_uverbs_query_srq::driver_data"]
        [::std::mem::offset_of!(ib_uverbs_query_srq, driver_data) - 16usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_query_srq_resp {
    pub max_wr: __u32,
    pub max_sge: __u32,
    pub srq_limit: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_srq_resp"]
        [::std::mem::size_of::<ib_uverbs_query_srq_resp>() - 16usize];
    ["Alignment of ib_uverbs_query_srq_resp"]
        [::std::mem::align_of::<ib_uverbs_query_srq_resp>() - 4usize];
    ["Offset of field: ib_uverbs_query_srq_resp::max_wr"]
        [::std::mem::offset_of!(ib_uverbs_query_srq_resp, max_wr) - 0usize];
    ["Offset of field: ib_uverbs_query_srq_resp::max_sge"]
        [::std::mem::offset_of!(ib_uverbs_query_srq_resp, max_sge) - 4usize];
    ["Offset of field: ib_uverbs_query_srq_resp::srq_limit"]
        [::std::mem::offset_of!(ib_uverbs_query_srq_resp, srq_limit) - 8usize];
    ["Offset of field: ib_uverbs_query_srq_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_query_srq_resp, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_srq {
    pub response: __u64,
    pub srq_handle: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_destroy_srq"][::std::mem::size_of::<ib_uverbs_destroy_srq>() - 16usize];
    ["Alignment of ib_uverbs_destroy_srq"]
        [::std::mem::align_of::<ib_uverbs_destroy_srq>() - 8usize];
    ["Offset of field: ib_uverbs_destroy_srq::response"]
        [::std::mem::offset_of!(ib_uverbs_destroy_srq, response) - 0usize];
    ["Offset of field: ib_uverbs_destroy_srq::srq_handle"]
        [::std::mem::offset_of!(ib_uverbs_destroy_srq, srq_handle) - 8usize];
    ["Offset of field: ib_uverbs_destroy_srq::reserved"]
        [::std::mem::offset_of!(ib_uverbs_destroy_srq, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_destroy_srq_resp {
    pub events_reported: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_destroy_srq_resp"]
        [::std::mem::size_of::<ib_uverbs_destroy_srq_resp>() - 4usize];
    ["Alignment of ib_uverbs_destroy_srq_resp"]
        [::std::mem::align_of::<ib_uverbs_destroy_srq_resp>() - 4usize];
    ["Offset of field: ib_uverbs_destroy_srq_resp::events_reported"]
        [::std::mem::offset_of!(ib_uverbs_destroy_srq_resp, events_reported) - 0usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_create_wq {
    pub comp_mask: __u32,
    pub wq_type: __u32,
    pub user_handle: __u64,
    pub pd_handle: __u32,
    pub cq_handle: __u32,
    pub max_wr: __u32,
    pub max_sge: __u32,
    pub create_flags: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_create_wq"][::std::mem::size_of::<ib_uverbs_ex_create_wq>() - 40usize];
    ["Alignment of ib_uverbs_ex_create_wq"]
        [::std::mem::align_of::<ib_uverbs_ex_create_wq>() - 8usize];
    ["Offset of field: ib_uverbs_ex_create_wq::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_create_wq::wq_type"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, wq_type) - 4usize];
    ["Offset of field: ib_uverbs_ex_create_wq::user_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, user_handle) - 8usize];
    ["Offset of field: ib_uverbs_ex_create_wq::pd_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, pd_handle) - 16usize];
    ["Offset of field: ib_uverbs_ex_create_wq::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, cq_handle) - 20usize];
    ["Offset of field: ib_uverbs_ex_create_wq::max_wr"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, max_wr) - 24usize];
    ["Offset of field: ib_uverbs_ex_create_wq::max_sge"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, max_sge) - 28usize];
    ["Offset of field: ib_uverbs_ex_create_wq::create_flags"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, create_flags) - 32usize];
    ["Offset of field: ib_uverbs_ex_create_wq::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq, reserved) - 36usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_create_wq_resp {
    pub comp_mask: __u32,
    pub response_length: __u32,
    pub wq_handle: __u32,
    pub max_wr: __u32,
    pub max_sge: __u32,
    pub wqn: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_create_wq_resp"]
        [::std::mem::size_of::<ib_uverbs_ex_create_wq_resp>() - 24usize];
    ["Alignment of ib_uverbs_ex_create_wq_resp"]
        [::std::mem::align_of::<ib_uverbs_ex_create_wq_resp>() - 4usize];
    ["Offset of field: ib_uverbs_ex_create_wq_resp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq_resp, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_create_wq_resp::response_length"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq_resp, response_length) - 4usize];
    ["Offset of field: ib_uverbs_ex_create_wq_resp::wq_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq_resp, wq_handle) - 8usize];
    ["Offset of field: ib_uverbs_ex_create_wq_resp::max_wr"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq_resp, max_wr) - 12usize];
    ["Offset of field: ib_uverbs_ex_create_wq_resp::max_sge"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq_resp, max_sge) - 16usize];
    ["Offset of field: ib_uverbs_ex_create_wq_resp::wqn"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_wq_resp, wqn) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_destroy_wq {
    pub comp_mask: __u32,
    pub wq_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_destroy_wq"][::std::mem::size_of::<ib_uverbs_ex_destroy_wq>() - 8usize];
    ["Alignment of ib_uverbs_ex_destroy_wq"]
        [::std::mem::align_of::<ib_uverbs_ex_destroy_wq>() - 4usize];
    ["Offset of field: ib_uverbs_ex_destroy_wq::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_destroy_wq, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_destroy_wq::wq_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_destroy_wq, wq_handle) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_destroy_wq_resp {
    pub comp_mask: __u32,
    pub response_length: __u32,
    pub events_reported: __u32,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_destroy_wq_resp"]
        [::std::mem::size_of::<ib_uverbs_ex_destroy_wq_resp>() - 16usize];
    ["Alignment of ib_uverbs_ex_destroy_wq_resp"]
        [::std::mem::align_of::<ib_uverbs_ex_destroy_wq_resp>() - 4usize];
    ["Offset of field: ib_uverbs_ex_destroy_wq_resp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_destroy_wq_resp, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_destroy_wq_resp::response_length"]
        [::std::mem::offset_of!(ib_uverbs_ex_destroy_wq_resp, response_length) - 4usize];
    ["Offset of field: ib_uverbs_ex_destroy_wq_resp::events_reported"]
        [::std::mem::offset_of!(ib_uverbs_ex_destroy_wq_resp, events_reported) - 8usize];
    ["Offset of field: ib_uverbs_ex_destroy_wq_resp::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_destroy_wq_resp, reserved) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_modify_wq {
    pub attr_mask: __u32,
    pub wq_handle: __u32,
    pub wq_state: __u32,
    pub curr_wq_state: __u32,
    pub flags: __u32,
    pub flags_mask: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_modify_wq"][::std::mem::size_of::<ib_uverbs_ex_modify_wq>() - 24usize];
    ["Alignment of ib_uverbs_ex_modify_wq"]
        [::std::mem::align_of::<ib_uverbs_ex_modify_wq>() - 4usize];
    ["Offset of field: ib_uverbs_ex_modify_wq::attr_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_wq, attr_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_modify_wq::wq_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_wq, wq_handle) - 4usize];
    ["Offset of field: ib_uverbs_ex_modify_wq::wq_state"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_wq, wq_state) - 8usize];
    ["Offset of field: ib_uverbs_ex_modify_wq::curr_wq_state"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_wq, curr_wq_state) - 12usize];
    ["Offset of field: ib_uverbs_ex_modify_wq::flags"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_wq, flags) - 16usize];
    ["Offset of field: ib_uverbs_ex_modify_wq::flags_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_wq, flags_mask) - 20usize];
};
#[repr(C)]
#[derive(Debug, Default)]
pub struct ib_uverbs_ex_create_rwq_ind_table {
    pub comp_mask: __u32,
    pub log_ind_tbl_size: __u32,
    pub wq_handles: __IncompleteArrayField<__u32>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_create_rwq_ind_table"]
        [::std::mem::size_of::<ib_uverbs_ex_create_rwq_ind_table>() - 8usize];
    ["Alignment of ib_uverbs_ex_create_rwq_ind_table"]
        [::std::mem::align_of::<ib_uverbs_ex_create_rwq_ind_table>() - 4usize];
    ["Offset of field: ib_uverbs_ex_create_rwq_ind_table::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_rwq_ind_table, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_create_rwq_ind_table::log_ind_tbl_size"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_rwq_ind_table, log_ind_tbl_size) - 4usize];
    ["Offset of field: ib_uverbs_ex_create_rwq_ind_table::wq_handles"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_rwq_ind_table, wq_handles) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_create_rwq_ind_table_resp {
    pub comp_mask: __u32,
    pub response_length: __u32,
    pub ind_tbl_handle: __u32,
    pub ind_tbl_num: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_create_rwq_ind_table_resp"]
        [::std::mem::size_of::<ib_uverbs_ex_create_rwq_ind_table_resp>() - 16usize];
    ["Alignment of ib_uverbs_ex_create_rwq_ind_table_resp"]
        [::std::mem::align_of::<ib_uverbs_ex_create_rwq_ind_table_resp>() - 4usize];
    ["Offset of field: ib_uverbs_ex_create_rwq_ind_table_resp::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_rwq_ind_table_resp, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_create_rwq_ind_table_resp::response_length"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_rwq_ind_table_resp, response_length) - 4usize];
    ["Offset of field: ib_uverbs_ex_create_rwq_ind_table_resp::ind_tbl_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_rwq_ind_table_resp, ind_tbl_handle) - 8usize];
    ["Offset of field: ib_uverbs_ex_create_rwq_ind_table_resp::ind_tbl_num"]
        [::std::mem::offset_of!(ib_uverbs_ex_create_rwq_ind_table_resp, ind_tbl_num) - 12usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_destroy_rwq_ind_table {
    pub comp_mask: __u32,
    pub ind_tbl_handle: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_destroy_rwq_ind_table"]
        [::std::mem::size_of::<ib_uverbs_ex_destroy_rwq_ind_table>() - 8usize];
    ["Alignment of ib_uverbs_ex_destroy_rwq_ind_table"]
        [::std::mem::align_of::<ib_uverbs_ex_destroy_rwq_ind_table>() - 4usize];
    ["Offset of field: ib_uverbs_ex_destroy_rwq_ind_table::comp_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_destroy_rwq_ind_table, comp_mask) - 0usize];
    ["Offset of field: ib_uverbs_ex_destroy_rwq_ind_table::ind_tbl_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_destroy_rwq_ind_table, ind_tbl_handle) - 4usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_cq_moderation {
    pub cq_count: __u16,
    pub cq_period: __u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_cq_moderation"][::std::mem::size_of::<ib_uverbs_cq_moderation>() - 4usize];
    ["Alignment of ib_uverbs_cq_moderation"]
        [::std::mem::align_of::<ib_uverbs_cq_moderation>() - 2usize];
    ["Offset of field: ib_uverbs_cq_moderation::cq_count"]
        [::std::mem::offset_of!(ib_uverbs_cq_moderation, cq_count) - 0usize];
    ["Offset of field: ib_uverbs_cq_moderation::cq_period"]
        [::std::mem::offset_of!(ib_uverbs_cq_moderation, cq_period) - 2usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_ex_modify_cq {
    pub cq_handle: __u32,
    pub attr_mask: __u32,
    pub attr: ib_uverbs_cq_moderation,
    pub reserved: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_ex_modify_cq"][::std::mem::size_of::<ib_uverbs_ex_modify_cq>() - 16usize];
    ["Alignment of ib_uverbs_ex_modify_cq"]
        [::std::mem::align_of::<ib_uverbs_ex_modify_cq>() - 4usize];
    ["Offset of field: ib_uverbs_ex_modify_cq::cq_handle"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_cq, cq_handle) - 0usize];
    ["Offset of field: ib_uverbs_ex_modify_cq::attr_mask"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_cq, attr_mask) - 4usize];
    ["Offset of field: ib_uverbs_ex_modify_cq::attr"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_cq, attr) - 8usize];
    ["Offset of field: ib_uverbs_ex_modify_cq::reserved"]
        [::std::mem::offset_of!(ib_uverbs_ex_modify_cq, reserved) - 12usize];
};
pub const IB_UVERBS_DEVICE_RESIZE_MAX_WR: ib_uverbs_device_cap_flags = 1;
pub const IB_UVERBS_DEVICE_BAD_PKEY_CNTR: ib_uverbs_device_cap_flags = 2;
pub const IB_UVERBS_DEVICE_BAD_QKEY_CNTR: ib_uverbs_device_cap_flags = 4;
pub const IB_UVERBS_DEVICE_RAW_MULTI: ib_uverbs_device_cap_flags = 8;
pub const IB_UVERBS_DEVICE_AUTO_PATH_MIG: ib_uverbs_device_cap_flags = 16;
pub const IB_UVERBS_DEVICE_CHANGE_PHY_PORT: ib_uverbs_device_cap_flags = 32;
pub const IB_UVERBS_DEVICE_UD_AV_PORT_ENFORCE: ib_uverbs_device_cap_flags = 64;
pub const IB_UVERBS_DEVICE_CURR_QP_STATE_MOD: ib_uverbs_device_cap_flags = 128;
pub const IB_UVERBS_DEVICE_SHUTDOWN_PORT: ib_uverbs_device_cap_flags = 256;
pub const IB_UVERBS_DEVICE_PORT_ACTIVE_EVENT: ib_uverbs_device_cap_flags = 1024;
pub const IB_UVERBS_DEVICE_SYS_IMAGE_GUID: ib_uverbs_device_cap_flags = 2048;
pub const IB_UVERBS_DEVICE_RC_RNR_NAK_GEN: ib_uverbs_device_cap_flags = 4096;
pub const IB_UVERBS_DEVICE_SRQ_RESIZE: ib_uverbs_device_cap_flags = 8192;
pub const IB_UVERBS_DEVICE_N_NOTIFY_CQ: ib_uverbs_device_cap_flags = 16384;
pub const IB_UVERBS_DEVICE_MEM_WINDOW: ib_uverbs_device_cap_flags = 131072;
pub const IB_UVERBS_DEVICE_UD_IP_CSUM: ib_uverbs_device_cap_flags = 262144;
pub const IB_UVERBS_DEVICE_XRC: ib_uverbs_device_cap_flags = 1048576;
pub const IB_UVERBS_DEVICE_MEM_MGT_EXTENSIONS: ib_uverbs_device_cap_flags = 2097152;
pub const IB_UVERBS_DEVICE_MEM_WINDOW_TYPE_2A: ib_uverbs_device_cap_flags = 8388608;
pub const IB_UVERBS_DEVICE_MEM_WINDOW_TYPE_2B: ib_uverbs_device_cap_flags = 16777216;
pub const IB_UVERBS_DEVICE_RC_IP_CSUM: ib_uverbs_device_cap_flags = 33554432;
pub const IB_UVERBS_DEVICE_RAW_IP_CSUM: ib_uverbs_device_cap_flags = 67108864;
pub const IB_UVERBS_DEVICE_MANAGED_FLOW_STEERING: ib_uverbs_device_cap_flags = 536870912;
pub const IB_UVERBS_DEVICE_RAW_SCATTER_FCS: ib_uverbs_device_cap_flags = 17179869184;
pub const IB_UVERBS_DEVICE_PCI_WRITE_END_PADDING: ib_uverbs_device_cap_flags = 68719476736;
pub const IB_UVERBS_DEVICE_FLUSH_GLOBAL: ib_uverbs_device_cap_flags = 274877906944;
pub const IB_UVERBS_DEVICE_FLUSH_PERSISTENT: ib_uverbs_device_cap_flags = 549755813888;
pub const IB_UVERBS_DEVICE_ATOMIC_WRITE: ib_uverbs_device_cap_flags = 1099511627776;
pub type ib_uverbs_device_cap_flags = ::std::os::raw::c_ulong;
pub const IB_UVERBS_RAW_PACKET_CAP_CVLAN_STRIPPING: ib_uverbs_raw_packet_caps = 1;
pub const IB_UVERBS_RAW_PACKET_CAP_SCATTER_FCS: ib_uverbs_raw_packet_caps = 2;
pub const IB_UVERBS_RAW_PACKET_CAP_IP_CSUM: ib_uverbs_raw_packet_caps = 4;
pub const IB_UVERBS_RAW_PACKET_CAP_DELAY_DROP: ib_uverbs_raw_packet_caps = 8;
pub type ib_uverbs_raw_packet_caps = ::std::os::raw::c_uint;
pub const IB_UVERBS_CORE_SUPPORT_OPTIONAL_MR_ACCESS: ib_uverbs_core_support = 1;
pub type ib_uverbs_core_support = ::std::os::raw::c_uint;
pub const IB_UVERBS_ACCESS_LOCAL_WRITE: ib_uverbs_access_flags = 1;
pub const IB_UVERBS_ACCESS_REMOTE_WRITE: ib_uverbs_access_flags = 2;
pub const IB_UVERBS_ACCESS_REMOTE_READ: ib_uverbs_access_flags = 4;
pub const IB_UVERBS_ACCESS_REMOTE_ATOMIC: ib_uverbs_access_flags = 8;
pub const IB_UVERBS_ACCESS_MW_BIND: ib_uverbs_access_flags = 16;
pub const IB_UVERBS_ACCESS_ZERO_BASED: ib_uverbs_access_flags = 32;
pub const IB_UVERBS_ACCESS_ON_DEMAND: ib_uverbs_access_flags = 64;
pub const IB_UVERBS_ACCESS_HUGETLB: ib_uverbs_access_flags = 128;
pub const IB_UVERBS_ACCESS_FLUSH_GLOBAL: ib_uverbs_access_flags = 256;
pub const IB_UVERBS_ACCESS_FLUSH_PERSISTENT: ib_uverbs_access_flags = 512;
pub const IB_UVERBS_ACCESS_RELAXED_ORDERING: ib_uverbs_access_flags = 1048576;
pub const IB_UVERBS_ACCESS_OPTIONAL_RANGE: ib_uverbs_access_flags = 1072693248;
pub type ib_uverbs_access_flags = ::std::os::raw::c_uint;
pub const IB_UVERBS_SRQT_BASIC: ib_uverbs_srq_type = 0;
pub const IB_UVERBS_SRQT_XRC: ib_uverbs_srq_type = 1;
pub const IB_UVERBS_SRQT_TM: ib_uverbs_srq_type = 2;
pub type ib_uverbs_srq_type = ::std::os::raw::c_uint;
pub const IB_UVERBS_WQT_RQ: ib_uverbs_wq_type = 0;
pub type ib_uverbs_wq_type = ::std::os::raw::c_uint;
pub const IB_UVERBS_WQ_FLAGS_CVLAN_STRIPPING: ib_uverbs_wq_flags = 1;
pub const IB_UVERBS_WQ_FLAGS_SCATTER_FCS: ib_uverbs_wq_flags = 2;
pub const IB_UVERBS_WQ_FLAGS_DELAY_DROP: ib_uverbs_wq_flags = 4;
pub const IB_UVERBS_WQ_FLAGS_PCI_WRITE_END_PADDING: ib_uverbs_wq_flags = 8;
pub type ib_uverbs_wq_flags = ::std::os::raw::c_uint;
pub const IB_UVERBS_QPT_RC: ib_uverbs_qp_type = 2;
pub const IB_UVERBS_QPT_UC: ib_uverbs_qp_type = 3;
pub const IB_UVERBS_QPT_UD: ib_uverbs_qp_type = 4;
pub const IB_UVERBS_QPT_RAW_PACKET: ib_uverbs_qp_type = 8;
pub const IB_UVERBS_QPT_XRC_INI: ib_uverbs_qp_type = 9;
pub const IB_UVERBS_QPT_XRC_TGT: ib_uverbs_qp_type = 10;
pub const IB_UVERBS_QPT_DRIVER: ib_uverbs_qp_type = 255;
pub type ib_uverbs_qp_type = ::std::os::raw::c_uint;
pub const IB_UVERBS_QP_CREATE_BLOCK_MULTICAST_LOOPBACK: ib_uverbs_qp_create_flags = 2;
pub const IB_UVERBS_QP_CREATE_SCATTER_FCS: ib_uverbs_qp_create_flags = 256;
pub const IB_UVERBS_QP_CREATE_CVLAN_STRIPPING: ib_uverbs_qp_create_flags = 512;
pub const IB_UVERBS_QP_CREATE_PCI_WRITE_END_PADDING: ib_uverbs_qp_create_flags = 2048;
pub const IB_UVERBS_QP_CREATE_SQ_SIG_ALL: ib_uverbs_qp_create_flags = 4096;
pub type ib_uverbs_qp_create_flags = ::std::os::raw::c_uint;
pub const IB_UVERBS_PCF_SM: ib_uverbs_query_port_cap_flags = 2;
pub const IB_UVERBS_PCF_NOTICE_SUP: ib_uverbs_query_port_cap_flags = 4;
pub const IB_UVERBS_PCF_TRAP_SUP: ib_uverbs_query_port_cap_flags = 8;
pub const IB_UVERBS_PCF_OPT_IPD_SUP: ib_uverbs_query_port_cap_flags = 16;
pub const IB_UVERBS_PCF_AUTO_MIGR_SUP: ib_uverbs_query_port_cap_flags = 32;
pub const IB_UVERBS_PCF_SL_MAP_SUP: ib_uverbs_query_port_cap_flags = 64;
pub const IB_UVERBS_PCF_MKEY_NVRAM: ib_uverbs_query_port_cap_flags = 128;
pub const IB_UVERBS_PCF_PKEY_NVRAM: ib_uverbs_query_port_cap_flags = 256;
pub const IB_UVERBS_PCF_LED_INFO_SUP: ib_uverbs_query_port_cap_flags = 512;
pub const IB_UVERBS_PCF_SM_DISABLED: ib_uverbs_query_port_cap_flags = 1024;
pub const IB_UVERBS_PCF_SYS_IMAGE_GUID_SUP: ib_uverbs_query_port_cap_flags = 2048;
pub const IB_UVERBS_PCF_PKEY_SW_EXT_PORT_TRAP_SUP: ib_uverbs_query_port_cap_flags = 4096;
pub const IB_UVERBS_PCF_EXTENDED_SPEEDS_SUP: ib_uverbs_query_port_cap_flags = 16384;
pub const IB_UVERBS_PCF_CM_SUP: ib_uverbs_query_port_cap_flags = 65536;
pub const IB_UVERBS_PCF_SNMP_TUNNEL_SUP: ib_uverbs_query_port_cap_flags = 131072;
pub const IB_UVERBS_PCF_REINIT_SUP: ib_uverbs_query_port_cap_flags = 262144;
pub const IB_UVERBS_PCF_DEVICE_MGMT_SUP: ib_uverbs_query_port_cap_flags = 524288;
pub const IB_UVERBS_PCF_VENDOR_CLASS_SUP: ib_uverbs_query_port_cap_flags = 1048576;
pub const IB_UVERBS_PCF_DR_NOTICE_SUP: ib_uverbs_query_port_cap_flags = 2097152;
pub const IB_UVERBS_PCF_CAP_MASK_NOTICE_SUP: ib_uverbs_query_port_cap_flags = 4194304;
pub const IB_UVERBS_PCF_BOOT_MGMT_SUP: ib_uverbs_query_port_cap_flags = 8388608;
pub const IB_UVERBS_PCF_LINK_LATENCY_SUP: ib_uverbs_query_port_cap_flags = 16777216;
pub const IB_UVERBS_PCF_CLIENT_REG_SUP: ib_uverbs_query_port_cap_flags = 33554432;
pub const IB_UVERBS_PCF_LINK_SPEED_WIDTH_TABLE_SUP: ib_uverbs_query_port_cap_flags = 134217728;
pub const IB_UVERBS_PCF_VENDOR_SPECIFIC_MADS_TABLE_SUP: ib_uverbs_query_port_cap_flags = 268435456;
pub const IB_UVERBS_PCF_MCAST_PKEY_TRAP_SUPPRESSION_SUP: ib_uverbs_query_port_cap_flags = 536870912;
pub const IB_UVERBS_PCF_MCAST_FDB_TOP_SUP: ib_uverbs_query_port_cap_flags = 1073741824;
pub const IB_UVERBS_PCF_HIERARCHY_INFO_SUP: ib_uverbs_query_port_cap_flags = 2147483648;
pub const IB_UVERBS_PCF_IP_BASED_GIDS: ib_uverbs_query_port_cap_flags = 67108864;
pub type ib_uverbs_query_port_cap_flags = ::std::os::raw::c_uint;
pub const IB_UVERBS_QPF_GRH_REQUIRED: ib_uverbs_query_port_flags = 1;
pub type ib_uverbs_query_port_flags = ::std::os::raw::c_uint;
pub const IB_UVERBS_FLOW_ACTION_ESP_KEYMAT_AES_GCM: ib_uverbs_flow_action_esp_keymat = 0;
pub type ib_uverbs_flow_action_esp_keymat = ::std::os::raw::c_uint;
pub const IB_UVERBS_FLOW_ACTION_IV_ALGO_SEQ: ib_uverbs_flow_action_esp_keymat_aes_gcm_iv_algo = 0;
pub type ib_uverbs_flow_action_esp_keymat_aes_gcm_iv_algo = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_action_esp_keymat_aes_gcm {
    pub iv: __u64,
    pub iv_algo: __u32,
    pub salt: __u32,
    pub icv_len: __u32,
    pub key_len: __u32,
    pub aes_key: [__u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp_keymat_aes_gcm"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp_keymat_aes_gcm>() - 56usize];
    ["Alignment of ib_uverbs_flow_action_esp_keymat_aes_gcm"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp_keymat_aes_gcm>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp_keymat_aes_gcm::iv"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_keymat_aes_gcm, iv) - 0usize];
    ["Offset of field: ib_uverbs_flow_action_esp_keymat_aes_gcm::iv_algo"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_keymat_aes_gcm, iv_algo) - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp_keymat_aes_gcm::salt"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_keymat_aes_gcm, salt) - 12usize];
    ["Offset of field: ib_uverbs_flow_action_esp_keymat_aes_gcm::icv_len"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_keymat_aes_gcm, icv_len) - 16usize];
    ["Offset of field: ib_uverbs_flow_action_esp_keymat_aes_gcm::key_len"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_keymat_aes_gcm, key_len) - 20usize];
    ["Offset of field: ib_uverbs_flow_action_esp_keymat_aes_gcm::aes_key"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_keymat_aes_gcm, aes_key) - 24usize];
};
pub const IB_UVERBS_FLOW_ACTION_ESP_REPLAY_NONE: ib_uverbs_flow_action_esp_replay = 0;
pub const IB_UVERBS_FLOW_ACTION_ESP_REPLAY_BMP: ib_uverbs_flow_action_esp_replay = 1;
pub type ib_uverbs_flow_action_esp_replay = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_action_esp_replay_bmp {
    pub size: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp_replay_bmp"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp_replay_bmp>() - 4usize];
    ["Alignment of ib_uverbs_flow_action_esp_replay_bmp"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp_replay_bmp>() - 4usize];
    ["Offset of field: ib_uverbs_flow_action_esp_replay_bmp::size"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_replay_bmp, size) - 0usize];
};
pub const IB_UVERBS_FLOW_ACTION_ESP_FLAGS_INLINE_CRYPTO: ib_uverbs_flow_action_esp_flags = 0;
pub const IB_UVERBS_FLOW_ACTION_ESP_FLAGS_FULL_OFFLOAD: ib_uverbs_flow_action_esp_flags = 1;
pub const IB_UVERBS_FLOW_ACTION_ESP_FLAGS_TUNNEL: ib_uverbs_flow_action_esp_flags = 0;
pub const IB_UVERBS_FLOW_ACTION_ESP_FLAGS_TRANSPORT: ib_uverbs_flow_action_esp_flags = 2;
pub const IB_UVERBS_FLOW_ACTION_ESP_FLAGS_DECRYPT: ib_uverbs_flow_action_esp_flags = 0;
pub const IB_UVERBS_FLOW_ACTION_ESP_FLAGS_ENCRYPT: ib_uverbs_flow_action_esp_flags = 4;
pub const IB_UVERBS_FLOW_ACTION_ESP_FLAGS_ESN_NEW_WINDOW: ib_uverbs_flow_action_esp_flags = 8;
pub type ib_uverbs_flow_action_esp_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ib_uverbs_flow_action_esp_encap {
    pub __bindgen_anon_1: ib_uverbs_flow_action_esp_encap__bindgen_ty_1,
    pub __bindgen_anon_2: ib_uverbs_flow_action_esp_encap__bindgen_ty_2,
    pub len: __u16,
    pub type_: __u16,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_flow_action_esp_encap__bindgen_ty_1 {
    pub val_ptr: *mut ::std::os::raw::c_void,
    pub val_ptr_data_u64: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp_encap__bindgen_ty_1"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp_encap__bindgen_ty_1>() - 8usize];
    ["Alignment of ib_uverbs_flow_action_esp_encap__bindgen_ty_1"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp_encap__bindgen_ty_1>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap__bindgen_ty_1::val_ptr"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_encap__bindgen_ty_1, val_ptr) - 0usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap__bindgen_ty_1::val_ptr_data_u64"][::std::mem::offset_of!(
        ib_uverbs_flow_action_esp_encap__bindgen_ty_1,
        val_ptr_data_u64
    )
        - 0usize];
};
impl Default for ib_uverbs_flow_action_esp_encap__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ib_uverbs_flow_action_esp_encap__bindgen_ty_2 {
    pub next_ptr: *mut ib_uverbs_flow_action_esp_encap,
    pub next_ptr_data_u64: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp_encap__bindgen_ty_2"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp_encap__bindgen_ty_2>() - 8usize];
    ["Alignment of ib_uverbs_flow_action_esp_encap__bindgen_ty_2"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp_encap__bindgen_ty_2>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap__bindgen_ty_2::next_ptr"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_encap__bindgen_ty_2, next_ptr) - 0usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap__bindgen_ty_2::next_ptr_data_u64"][::std::mem::offset_of!(
        ib_uverbs_flow_action_esp_encap__bindgen_ty_2,
        next_ptr_data_u64
    )
        - 0usize];
};
impl Default for ib_uverbs_flow_action_esp_encap__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp_encap"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp_encap>() - 24usize];
    ["Alignment of ib_uverbs_flow_action_esp_encap"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp_encap>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap::len"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_encap, len) - 16usize];
    ["Offset of field: ib_uverbs_flow_action_esp_encap::type_"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp_encap, type_) - 18usize];
};
impl Default for ib_uverbs_flow_action_esp_encap {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_flow_action_esp {
    pub spi: __u32,
    pub seq: __u32,
    pub tfc_pad: __u32,
    pub flags: __u32,
    pub hard_limit_pkts: __u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_flow_action_esp"]
        [::std::mem::size_of::<ib_uverbs_flow_action_esp>() - 24usize];
    ["Alignment of ib_uverbs_flow_action_esp"]
        [::std::mem::align_of::<ib_uverbs_flow_action_esp>() - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp::spi"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, spi) - 0usize];
    ["Offset of field: ib_uverbs_flow_action_esp::seq"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, seq) - 4usize];
    ["Offset of field: ib_uverbs_flow_action_esp::tfc_pad"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, tfc_pad) - 8usize];
    ["Offset of field: ib_uverbs_flow_action_esp::flags"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, flags) - 12usize];
    ["Offset of field: ib_uverbs_flow_action_esp::hard_limit_pkts"]
        [::std::mem::offset_of!(ib_uverbs_flow_action_esp, hard_limit_pkts) - 16usize];
};
pub const IB_UVERBS_READ_COUNTERS_PREFER_CACHED: ib_uverbs_read_counters_flags = 1;
pub type ib_uverbs_read_counters_flags = ::std::os::raw::c_uint;
pub const IB_UVERBS_ADVISE_MR_ADVICE_PREFETCH: ib_uverbs_advise_mr_advice = 0;
pub const IB_UVERBS_ADVISE_MR_ADVICE_PREFETCH_WRITE: ib_uverbs_advise_mr_advice = 1;
pub const IB_UVERBS_ADVISE_MR_ADVICE_PREFETCH_NO_FAULT: ib_uverbs_advise_mr_advice = 2;
pub type ib_uverbs_advise_mr_advice = ::std::os::raw::c_uint;
pub const IB_UVERBS_ADVISE_MR_FLAG_FLUSH: ib_uverbs_advise_mr_flag = 1;
pub type ib_uverbs_advise_mr_flag = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_query_port_resp_ex {
    pub legacy_resp: ib_uverbs_query_port_resp,
    pub port_cap_flags2: __u16,
    pub reserved: [__u8; 2usize],
    pub active_speed_ex: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_query_port_resp_ex"]
        [::std::mem::size_of::<ib_uverbs_query_port_resp_ex>() - 48usize];
    ["Alignment of ib_uverbs_query_port_resp_ex"]
        [::std::mem::align_of::<ib_uverbs_query_port_resp_ex>() - 4usize];
    ["Offset of field: ib_uverbs_query_port_resp_ex::legacy_resp"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp_ex, legacy_resp) - 0usize];
    ["Offset of field: ib_uverbs_query_port_resp_ex::port_cap_flags2"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp_ex, port_cap_flags2) - 40usize];
    ["Offset of field: ib_uverbs_query_port_resp_ex::reserved"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp_ex, reserved) - 42usize];
    ["Offset of field: ib_uverbs_query_port_resp_ex::active_speed_ex"]
        [::std::mem::offset_of!(ib_uverbs_query_port_resp_ex, active_speed_ex) - 44usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_qp_cap {
    pub max_send_wr: __u32,
    pub max_recv_wr: __u32,
    pub max_send_sge: __u32,
    pub max_recv_sge: __u32,
    pub max_inline_data: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_qp_cap"][::std::mem::size_of::<ib_uverbs_qp_cap>() - 20usize];
    ["Alignment of ib_uverbs_qp_cap"][::std::mem::align_of::<ib_uverbs_qp_cap>() - 4usize];
    ["Offset of field: ib_uverbs_qp_cap::max_send_wr"]
        [::std::mem::offset_of!(ib_uverbs_qp_cap, max_send_wr) - 0usize];
    ["Offset of field: ib_uverbs_qp_cap::max_recv_wr"]
        [::std::mem::offset_of!(ib_uverbs_qp_cap, max_recv_wr) - 4usize];
    ["Offset of field: ib_uverbs_qp_cap::max_send_sge"]
        [::std::mem::offset_of!(ib_uverbs_qp_cap, max_send_sge) - 8usize];
    ["Offset of field: ib_uverbs_qp_cap::max_recv_sge"]
        [::std::mem::offset_of!(ib_uverbs_qp_cap, max_recv_sge) - 12usize];
    ["Offset of field: ib_uverbs_qp_cap::max_inline_data"]
        [::std::mem::offset_of!(ib_uverbs_qp_cap, max_inline_data) - 16usize];
};
pub const RDMA_DRIVER_UNKNOWN: rdma_driver_id = 0;
pub const RDMA_DRIVER_MLX5: rdma_driver_id = 1;
pub const RDMA_DRIVER_MLX4: rdma_driver_id = 2;
pub const RDMA_DRIVER_CXGB3: rdma_driver_id = 3;
pub const RDMA_DRIVER_CXGB4: rdma_driver_id = 4;
pub const RDMA_DRIVER_MTHCA: rdma_driver_id = 5;
pub const RDMA_DRIVER_BNXT_RE: rdma_driver_id = 6;
pub const RDMA_DRIVER_OCRDMA: rdma_driver_id = 7;
pub const RDMA_DRIVER_NES: rdma_driver_id = 8;
pub const RDMA_DRIVER_I40IW: rdma_driver_id = 9;
pub const RDMA_DRIVER_IRDMA: rdma_driver_id = 9;
pub const RDMA_DRIVER_VMW_PVRDMA: rdma_driver_id = 10;
pub const RDMA_DRIVER_QEDR: rdma_driver_id = 11;
pub const RDMA_DRIVER_HNS: rdma_driver_id = 12;
pub const RDMA_DRIVER_USNIC: rdma_driver_id = 13;
pub const RDMA_DRIVER_RXE: rdma_driver_id = 14;
pub const RDMA_DRIVER_HFI1: rdma_driver_id = 15;
pub const RDMA_DRIVER_QIB: rdma_driver_id = 16;
pub const RDMA_DRIVER_EFA: rdma_driver_id = 17;
pub const RDMA_DRIVER_SIW: rdma_driver_id = 18;
pub const RDMA_DRIVER_ERDMA: rdma_driver_id = 19;
pub const RDMA_DRIVER_MANA: rdma_driver_id = 20;
pub type rdma_driver_id = ::std::os::raw::c_uint;
pub const IB_UVERBS_GID_TYPE_IB: ib_uverbs_gid_type = 0;
pub const IB_UVERBS_GID_TYPE_ROCE_V1: ib_uverbs_gid_type = 1;
pub const IB_UVERBS_GID_TYPE_ROCE_V2: ib_uverbs_gid_type = 2;
pub type ib_uverbs_gid_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ib_uverbs_gid_entry {
    pub gid: [__u64; 2usize],
    pub gid_index: __u32,
    pub port_num: __u32,
    pub gid_type: __u32,
    pub netdev_ifindex: __u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ib_uverbs_gid_entry"][::std::mem::size_of::<ib_uverbs_gid_entry>() - 32usize];
    ["Alignment of ib_uverbs_gid_entry"][::std::mem::align_of::<ib_uverbs_gid_entry>() - 8usize];
    ["Offset of field: ib_uverbs_gid_entry::gid"]
        [::std::mem::offset_of!(ib_uverbs_gid_entry, gid) - 0usize];
    ["Offset of field: ib_uverbs_gid_entry::gid_index"]
        [::std::mem::offset_of!(ib_uverbs_gid_entry, gid_index) - 16usize];
    ["Offset of field: ib_uverbs_gid_entry::port_num"]
        [::std::mem::offset_of!(ib_uverbs_gid_entry, port_num) - 20usize];
    ["Offset of field: ib_uverbs_gid_entry::gid_type"]
        [::std::mem::offset_of!(ib_uverbs_gid_entry, gid_type) - 24usize];
    ["Offset of field: ib_uverbs_gid_entry::netdev_ifindex"]
        [::std::mem::offset_of!(ib_uverbs_gid_entry, netdev_ifindex) - 28usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union ibv_gid {
    pub raw: [u8; 16usize],
    pub global: ibv_gid__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_gid__bindgen_ty_1 {
    pub subnet_prefix: __be64,
    pub interface_id: __be64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_gid__bindgen_ty_1"][::std::mem::size_of::<ibv_gid__bindgen_ty_1>() - 16usize];
    ["Alignment of ibv_gid__bindgen_ty_1"]
        [::std::mem::align_of::<ibv_gid__bindgen_ty_1>() - 8usize];
    ["Offset of field: ibv_gid__bindgen_ty_1::subnet_prefix"]
        [::std::mem::offset_of!(ibv_gid__bindgen_ty_1, subnet_prefix) - 0usize];
    ["Offset of field: ibv_gid__bindgen_ty_1::interface_id"]
        [::std::mem::offset_of!(ibv_gid__bindgen_ty_1, interface_id) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_gid"][::std::mem::size_of::<ibv_gid>() - 16usize];
    ["Alignment of ibv_gid"][::std::mem::align_of::<ibv_gid>() - 8usize];
    ["Offset of field: ibv_gid::raw"][::std::mem::offset_of!(ibv_gid, raw) - 0usize];
    ["Offset of field: ibv_gid::global"][::std::mem::offset_of!(ibv_gid, global) - 0usize];
};
impl Default for ibv_gid {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const IBV_GID_TYPE_IB: ibv_gid_type = 0;
pub const IBV_GID_TYPE_ROCE_V1: ibv_gid_type = 1;
pub const IBV_GID_TYPE_ROCE_V2: ibv_gid_type = 2;
pub type ibv_gid_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ibv_gid_entry {
    pub gid: ibv_gid,
    pub gid_index: u32,
    pub port_num: u32,
    pub gid_type: u32,
    pub ndev_ifindex: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_gid_entry"][::std::mem::size_of::<ibv_gid_entry>() - 32usize];
    ["Alignment of ibv_gid_entry"][::std::mem::align_of::<ibv_gid_entry>() - 8usize];
    ["Offset of field: ibv_gid_entry::gid"][::std::mem::offset_of!(ibv_gid_entry, gid) - 0usize];
    ["Offset of field: ibv_gid_entry::gid_index"]
        [::std::mem::offset_of!(ibv_gid_entry, gid_index) - 16usize];
    ["Offset of field: ibv_gid_entry::port_num"]
        [::std::mem::offset_of!(ibv_gid_entry, port_num) - 20usize];
    ["Offset of field: ibv_gid_entry::gid_type"]
        [::std::mem::offset_of!(ibv_gid_entry, gid_type) - 24usize];
    ["Offset of field: ibv_gid_entry::ndev_ifindex"]
        [::std::mem::offset_of!(ibv_gid_entry, ndev_ifindex) - 28usize];
};
impl Default for ibv_gid_entry {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const IBV_NODE_UNKNOWN: ibv_node_type = -1;
pub const IBV_NODE_CA: ibv_node_type = 1;
pub const IBV_NODE_SWITCH: ibv_node_type = 2;
pub const IBV_NODE_ROUTER: ibv_node_type = 3;
pub const IBV_NODE_RNIC: ibv_node_type = 4;
pub const IBV_NODE_USNIC: ibv_node_type = 5;
pub const IBV_NODE_USNIC_UDP: ibv_node_type = 6;
pub const IBV_NODE_UNSPECIFIED: ibv_node_type = 7;
pub type ibv_node_type = ::std::os::raw::c_int;
pub const IBV_TRANSPORT_UNKNOWN: ibv_transport_type = -1;
pub const IBV_TRANSPORT_IB: ibv_transport_type = 0;
pub const IBV_TRANSPORT_IWARP: ibv_transport_type = 1;
pub const IBV_TRANSPORT_USNIC: ibv_transport_type = 2;
pub const IBV_TRANSPORT_USNIC_UDP: ibv_transport_type = 3;
pub const IBV_TRANSPORT_UNSPECIFIED: ibv_transport_type = 4;
pub type ibv_transport_type = ::std::os::raw::c_int;
pub const IBV_DEVICE_RESIZE_MAX_WR: ibv_device_cap_flags = 1;
pub const IBV_DEVICE_BAD_PKEY_CNTR: ibv_device_cap_flags = 2;
pub const IBV_DEVICE_BAD_QKEY_CNTR: ibv_device_cap_flags = 4;
pub const IBV_DEVICE_RAW_MULTI: ibv_device_cap_flags = 8;
pub const IBV_DEVICE_AUTO_PATH_MIG: ibv_device_cap_flags = 16;
pub const IBV_DEVICE_CHANGE_PHY_PORT: ibv_device_cap_flags = 32;
pub const IBV_DEVICE_UD_AV_PORT_ENFORCE: ibv_device_cap_flags = 64;
pub const IBV_DEVICE_CURR_QP_STATE_MOD: ibv_device_cap_flags = 128;
pub const IBV_DEVICE_SHUTDOWN_PORT: ibv_device_cap_flags = 256;
pub const IBV_DEVICE_INIT_TYPE: ibv_device_cap_flags = 512;
pub const IBV_DEVICE_PORT_ACTIVE_EVENT: ibv_device_cap_flags = 1024;
pub const IBV_DEVICE_SYS_IMAGE_GUID: ibv_device_cap_flags = 2048;
pub const IBV_DEVICE_RC_RNR_NAK_GEN: ibv_device_cap_flags = 4096;
pub const IBV_DEVICE_SRQ_RESIZE: ibv_device_cap_flags = 8192;
pub const IBV_DEVICE_N_NOTIFY_CQ: ibv_device_cap_flags = 16384;
pub const IBV_DEVICE_MEM_WINDOW: ibv_device_cap_flags = 131072;
pub const IBV_DEVICE_UD_IP_CSUM: ibv_device_cap_flags = 262144;
pub const IBV_DEVICE_XRC: ibv_device_cap_flags = 1048576;
pub const IBV_DEVICE_MEM_MGT_EXTENSIONS: ibv_device_cap_flags = 2097152;
pub const IBV_DEVICE_MEM_WINDOW_TYPE_2A: ibv_device_cap_flags = 8388608;
pub const IBV_DEVICE_MEM_WINDOW_TYPE_2B: ibv_device_cap_flags = 16777216;
pub const IBV_DEVICE_RC_IP_CSUM: ibv_device_cap_flags = 33554432;
pub const IBV_DEVICE_RAW_IP_CSUM: ibv_device_cap_flags = 67108864;
pub const IBV_DEVICE_MANAGED_FLOW_STEERING: ibv_device_cap_flags = 536870912;
pub type ibv_device_cap_flags = ::std::os::raw::c_uint;
pub const IBV_FORK_DISABLED: ibv_fork_status = 0;
pub const IBV_FORK_ENABLED: ibv_fork_status = 1;
pub const IBV_FORK_UNNEEDED: ibv_fork_status = 2;
pub type ibv_fork_status = ::std::os::raw::c_uint;
pub const IBV_ATOMIC_NONE: ibv_atomic_cap = 0;
pub const IBV_ATOMIC_HCA: ibv_atomic_cap = 1;
pub const IBV_ATOMIC_GLOB: ibv_atomic_cap = 2;
pub type ibv_atomic_cap = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ibv_alloc_dm_attr {
    pub length: usize,
    pub log_align_req: u32,
    pub comp_mask: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_alloc_dm_attr"][::std::mem::size_of::<ibv_alloc_dm_attr>() - 16usize];
    ["Alignment of ibv_alloc_dm_attr"][::std::mem::align_of::<ibv_alloc_dm_attr>() - 8usize];
    ["Offset of field: ibv_alloc_dm_attr::length"]
        [::std::mem::offset_of!(ibv_alloc_dm_attr, length) - 0usize];
    ["Offset of field: ibv_alloc_dm_attr::log_align_req"]
        [::std::mem::offset_of!(ibv_alloc_dm_attr, log_align_req) - 8usize];
    ["Offset of field: ibv_alloc_dm_attr::comp_mask"]
        [::std::mem::offset_of!(ibv_alloc_dm_attr, comp_mask) - 12usize];
};
pub const IBV_DM_MASK_HANDLE: ibv_dm_mask = 1;
pub type ibv_dm_mask = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ibv_dm {
    pub context: *mut ibv_context,
    pub memcpy_to_dm: ::std::option::Option<
        unsafe extern "C" fn(
            dm: *mut ibv_dm,
            dm_offset: u64,
            host_addr: *const ::std::os::raw::c_void,
            length: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub memcpy_from_dm: ::std::option::Option<
        unsafe extern "C" fn(
            host_addr: *mut ::std::os::raw::c_void,
            dm: *mut ibv_dm,
            dm_offset: u64,
            length: usize,
        ) -> ::std::os::raw::c_int,
    >,
    pub comp_mask: u32,
    pub handle: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ibv_dm"][::std::mem::size_of::<ibv_dm>() - 32usize];
    ["Alignment of ibv_dm"][::std::mem::align_of::<ibv_dm>() - 8usize];
    ["Offset of field: ibv_dm::context"][::std::mem::offset_of!(ibv_dm, context) - 0usize];
    ["Offset of field: ibv_dm::memcpy_to_dm"]
        [::std::mem::offset_of!(ibv_dm, memcpy_to_dm) - 8usize];
    ["Offset of field: ibv_dm::memcpy_from_dm"]
        [::std::mem::offset_of!(ibv_dm, memcpy_from_dm) - 16usize];
    ["Offset of field: ibv_dm::comp_mask"][::std::mem::offset_of!(ibv_dm, comp_mask) - 24usize];
    ["Offset of field: ibv_dm::handle"][::std::mem::offset_of!(ibv_dm, handle) - 28usize];
};
impl Default for ibv_dm {
